{"petitions": [{"title": "Wrongly convicted, SaveDustinjHiggs​.​com help me change the narrative.", "description": "<p>Dustin John Higgs is going to be executed for a crime he didn’t commit. He was accused of killing three girls but later to be found not guilty. All witnesses, including the man who actually killed the girls, confirm Dustin's innocence.</p>\n<p><strong>This innocent man should be spared.</strong></p>\n<p>The only reason he’s still in jail is because they say he was at the scene of the crime and he was accused of bullying Willis Hayes (who did commit the crime) into killing the three girls. But even Willis Hayes has said that this is false. So please help me to free this innocent man. Don't let what happened to Brandon Bernard happen again.</p>\n<p><strong>Dustin is set to be executed on Martin Luther King Jr.'s birthday, January 15th. Help me stop this tragedy.</strong></p>\n<p>Dustin Higgs #31133-037</p>\n<p>Special Confinement Unit</p>\n<p>PO Box 33</p>\n<p>Terre Haute, In 47808</p>\n<p>Please! check out ...SaveDustinjHiggs.com</p>", "image_url": "https://assets.change.org/photos/3/tt/lb/pGTTlBrmbNNtQOj-800x450-noPad.jpg?1607707405"}, {"title": "Governor Pritzker Veto Illinois HB 3653", "description": "<p>Veto HB 3653. This bill doesn't allow illinois peace officers to fulfill their sworn oath and duty to help keep communities and citizens safe.&nbsp;</p>", "image_url": "https://assets.change.org/photos/1/cl/ou/ticloUNpJSczLiT-800x450-noPad.jpg?1610576760"}, {"title": "Justice4Jayla", "description": "<p>On August 29 , 2020 two girls came and vandalized my car after they vandalized my car one of the girls shot and killed my girlfriend Jayla English. One of the girls was my ex girlfriend the other I had never seen before. The two girls are named Brittany Lynn and Orniesha Levison. Brittany Lynn is the shooter and she is my ex girlfriend she is being held on a million dollar bond. But the second girl , Orniesha Levison is only being charged with manslaughter and is currently out on bail. Her bail was only $75,000. I am writing this petition to have Orniesha Levison charged with aggravated murder she came to our home with the intention of committing a crime and she left with the shooter. She is just as guilty a should be punished. Under the LAW if you are in the commission of a crime and someone gets killed you are just as responsible as the shooter! She should not be able to walk free ! She should be charge with MURDER #Justice4Jayla</p>", "image_url": "https://assets.change.org/photos/4/ex/tz/hFEXTzzxogWOeeO-800x450-noPad.jpg?1606853819"}, {"title": "Texans demand the resignation of Senator Ted Cruz", "description": "<p>For weeks, U.S. Senator from Texas, Ted Cruz has worked to undermine our Constitution and our electoral process by objecting to the Electoral College’s decision to elect Joe Biden.</p>\n<p><strong>On January 6th, his efforts to cast doubt on the legitimacy of the election and our very democracy resulted in the violent and treasonous storming of our Capitol, and the loss of a life.</strong></p>\n<p>To disenfranchise millions of American citizens contradicts the principles embedded in the U.S. Constitution. Therefore, we the citizens of Texas, and his constituents, call on Senator Ted Cruz to resign immediately for his failure to uphold the U.S. Constitution.</p>", "image_url": "https://assets.change.org/photos/6/qb/ob/lXqbOBUxrPEZxMl-800x450-noPad.jpg?1610047620"}, {"title": "HELP SAVE DUSTIN JOHN HIGGS", "description": "<p>This is Dustin john higgs &amp; he’s on death row , he was accused of killing 3 girls and later on they found out that he wasn’t the one who killed them . Their only reasoning on putting him on death row is because they said that he was there , and they said that he bullied the person who did kill those 3 girls into doing it even though, Willis Hayes the one who did commit the murders said that he did not bully him into killing them. Please get the word out so we can save his life !!&nbsp;</p>", "image_url": "https://assets.change.org/photos/5/go/df/yJGoDfGLpLqvfvI-800x450-noPad.jpg?1607681923"}, {"title": "Constituents Demanding Sen. Josh Hawley's Resignation", "description": "<p>We are constituents of Sen. Josh Hawley's seeking his resignation for inciting violence directed at the United States Congress. This latest display of violence highlights Sen. Hawley's disregard for American democracy, and it is a disgraceful use of his position and power in an attempt to overturn the 2020 General Election results. We demand Sen. Hawley's resignation and nothing less.&nbsp;</p>\n<p>Please also take a moment to visit: <a href=\"http://hawleyresign.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">http://hawleyresign.com</a> to sign on with others from across the state.</p>\n<p>Our coalition also very much supports Representative Cori Bush's petition, as well as the Movement for Black Lives demands, calling for the expulsion of all Senators and Representatives who sought to undermine the results of the 2020 election that resulted in the violent display of white supremacy on January 6th, 2021. Please visit <a href=\"http://www.gopcoup.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">www.gopcoup.com</a> to sign the petition.</p>", "image_url": "https://assets.change.org/photos/2/dm/ru/TlDMRuNMSuDjKif-800x450-noPad.jpg?1609969725"}, {"title": "IMPEACHED TWICE: IT’S TIME TO REMOVE 45!", "description": "<p>This campaign began on January 6, 2021 after I couldn’t stomach the insurrection at the Capitol, I had to do something, I dipped a toe before, but now I’m all in. 45 crossed a line even I didn’t think he was capable of, I started the petition to implore &nbsp;Mike Pence to use the 25th Amendment and remove this man before he causes more harm.&nbsp;</p>\n<p>On January 12, 2021, Mike Pence made a decision to stand by the man who’s words and actions caused an attempted coup, damaged the hall of Democracy and left 6 dead. Pence’s cowardice will only come back to bite him, but for now let’s tell 45 - “You’re Fired!”.</p>\n<p>After the domestic terrorist attack on the US Capitol building on January 6, 2021, spurned on by Donald Trump and Rudolph Guiliani’s inciting words at a rally earlier that day. Trump directed his followers to march to the Capitol, taking to heart Rudy’s “Trial by Combat” comment.&nbsp;</p>\n<p>The aftermath of the damage from the breach is palpable, 6 lives lost, many, many Americans feeling like the appointed leader of our government is more than unfit to serve, but actually a criminal. He must be removed immediately!</p>\n<p>Today, we saw the worst of Americans and it will not be forgotten. The attack took the lives of 4 civilians, multiple law enforcement members injured and one Capitol Police Officer Dead. It didn’t need to happen, our democracy did not need this challenge.</p>\n<p>Please help in signing this petition, so we can send a message to Mike Pence and the leaders in Washington to let them know that we are disgusted and appalled by these actions by “Donald Trump’s Domestic Terrorists”. Nothing less than removal of his authority and presidential privilege will do at this point, the one person elected to protect the country above all others, very, very literally let the foxes into the henhouse and caused damage and destruction, leaving 6 people dead.&nbsp;</p>", "image_url": "https://assets.change.org/photos/7/jy/ko/wvJyKoytPRrUdmd-800x450-noPad.jpg?1610157805"}, {"title": "Honor USCP Officer Eugene Goodman with the Medal of Freedom", "description": "<p>(Photo Credit: Ashley Gilbertson)<br><br>On Wednesday, January 6th, 2021, USPC Officer Eugene Goodman faced down a mob of angry rioters advancing in the US Capitol building. Despite his warnings, rioters advanced on the outnumbered officer. He retreated to the 2nd floor landing and called in his position to fellow officers to alert them to the growing threat.</p>\n<p>Officer Goodman noted that there were no visible guards at the Senate chamber doors. At the moment that the lead rioter also saw the open door, Officer Goodman placed himself in the path to direct harm and made physical contact with the rioter, provoking a response. The rioter took the bait and lead his followers after Officer Goodman, away from the Senate doors.&nbsp;</p>\n<p>Inside the Senate, the evacuation was not complete. If the rioters had breached that door, they would've found themselves face-to-face with Senate leaders. Bloodshed was a stark possibility.</p>\n<p>Instead, the rioters pursued Officer Goodman down another hall and into a larger vestibule where Capitol police backup was waiting to reinforce him. The incident was defused without injury and Senate leaders were able to safely evacuate.&nbsp;</p>\n<p>Officer Eugene Goodman recognized a critical moment where the lives of others were at stake. He courageously risked himself to divert rioters and exemplifies the courage an bravery that is the hallmark of Capitol law enforcement. In a very difficult time, his character shone through. <br><br>He is an American hero. <br><br>My fellow petitioners&nbsp; and I are calling on President Joe Biden to recognize his courage and his long career of defending the United Stated by awarding him the highest civilian honor, the Medal of Freedom!</p>", "image_url": "https://assets.change.org/photos/1/st/dl/qbStDlddAscAbQU-800x450-noPad.jpg?1610319654"}, {"title": "Force Joel Osteen to pay back any and all government aid funded by taxpayers.", "description": "<p>Joel Osteen and his church recently received over four million dollars in taxpayer-funded government aid. For his church that does not pay taxes. If you believe this is unfair to taxpayers, please stand with us.</p>\n<p><strong>This is not an issue of religion, this is not an issue of who you believe in. This is an issue of fairness.</strong> His business is the church, which apparently is doing quite well to afford this man a home and estate that is several million dollars. Whilst constantly riding in private jets and doing things normally reserved for the richest of people. This man is no longer a servant of Christ or his people, but a servant to the almighty dollar.</p>\n<p><strong>It’s clear that he is manipulating the system to maintain massive amounts of wealth.</strong> This is incredibly unfair to people that follow him, as they may think what he’s doing is justified in some sick way. Our government and this man should be held accountable for this gross overpayment and blatant disregard for taxpayer’s well-being.</p>\n<p>While the average American is struggling with covid, bills, work, and every other daily stress, this man is banking over four million dollars of our money. If you believe this is not to aid in his message of love and kindness of man and woman in the vision of God, or you simply believe his acts are unfair and downright slimy, please sign this petition to force him to pay back any government aid that was recieved.</p>\n<p>Thank you.&nbsp;</p>", "image_url": "https://assets.change.org/photos/7/nm/kl/mbnMKLIVPbXSlDk-800x450-noPad.jpg?1608674453"}, {"title": "Rare Yaak Montana Female Grizzly Poached! Tell Montana &amp; U​.​S. Government to Prosecute", "description": "<p><strong>Tell the U.S. Fish Wildlife Service and State of Montana to Prosecute and Increase the Penalty for Killing an Endangered Grizzly Bear. Tell Congress to Pass the Tribal Heritage and Grizzly Bear Protection Act.</strong></p>\n<p>In late November 2020, an adult female grizzly bear was brutally killed in the northwest Montana’s Yaak Valley. The killer or killers shot the bear, partially skinned and cut off her paws, before dumping the body in a driveway.&nbsp;</p>\n<p>An estimated 24 grizzlies remain in the Yaak Valley, and after this brutal poaching, they are more in need of your help than ever. The poached grizzly was one of possibly only 3-5 remaining females. These last two dozen bears are stubborn survivors on the U.S.-Canada border in a unique ecosystem where nothing has gone extinct since the end of the last Ice Age. Now climate change and poaching are the greatest threat to the grizzly.</p>\n<p>At present, it is unknown if she had cubs. If she did, they too would surely have perished. If they were a family of four, that would represent roughly 15% of the valley’s population in one day, and possibly an unbelievable one-third of the valley’s reproductive females.</p>\n<p>“Often called “the walking dead,” the tiny population of grizzly bears in northwest Montana’s Yaak Valley are the most endangered in the state,” stated Montana grizzly bear advocate, author, and activist Doug Peacock for Save The Yellowstone Grizzly.</p>\n<p>“Yaak grizzlies are already beset by an out-of-compliance high-volume through-hiker trail in their fragile habitat, a proposed mine beneath the Cabinet Mountains, and a Kootenai National Forest that seeks to implement clearcutting across four contiguous project areas totaling almost 250,000 acres without any Environmental Impact Statement—well, you get the picture—Yaak grizzlies need our help,” added Yaak Valley Forest Council Board Chair, author, and activist Rick Bass.&nbsp;<br>&nbsp;<br>“Please help us turn this around. There were an estimated 25 grizzlies remaining in the Yaak. Now that estimate is 24,” concluded author and activist Terry Tempest Williams of Save The Yellowstone Grizzly</p>\n<p>“There is such villainy in this act that I can hardly express my rage and sadness,” continued Montana-based author, environmental historian, and conservationist Betsy Gaines Quammen</p>\n<p>The state of Montana is only offering a paltry $1000 reward for information leading to the conviction of her killer or killers—hardly enough to solicit tips, or to act as a deterrent to other, future poachers.&nbsp;</p>\n<p><strong>We are asking the federal government and the State of Montana to:&nbsp;</strong><br>• Investigate and prosecute the Yaak poaching to the full extent of the law&nbsp;<br>• Increase the penalty for killing an endangered grizzly bear to $100,000&nbsp;<br>• Pass the Tribal Heritage and Grizzly Bear Protection Act with additional protections for the Yaak grizzly bear population.</p>\n<p><strong>Please sign our petition</strong> to be delivered to the new Secretary of the Interior, Congress, the State of Montana, as well as the House Committee on Natural Resources and the Chief of the U.S. Forest Service, demanding investigation, and greater protection for grizzlies on our public lands.&nbsp;</p>\n<p>Thank you from all of us at Save the Yellowstone Grizzly and the Yaak Valley Forest Council. Let's not let this mother grizzly die in vain.<br><br><a href=\"https://savetheyellowstonegrizzly.org/images/yaak-poaching/PRESS-RELEASE-Yaak-Grizzly-Killing-Reward-Yaak-Valley-Forest-Council-and-Save-The-Yellowstone-Grizzly.pdf\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Read the press release</a> (PDF)<br>&nbsp;<br><strong>Addendum:&nbsp;</strong><br>To offset the abysmal state reward amount of $1,000, Save The Yellowstone Grizzly and the Yaak Valley Forest Council have set up a supplemental reward fund. Our goal is to raise $50,000 to be added to the state reward fund.</p>\n<p>Click here if you would like to donate to the reward fund: <a href=\"https://donatenow.networkforgood.org/yaakgrizzlykillrewardfund\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">donatenow.networkforgood.org/yaakgrizzlykillrewardfund</a></p>\n<p>If you have information regarding this killing, call the state of Montana at: &nbsp;<br><strong>1-800-TIP-MONT (1-800-847-6668) </strong></p>\n<p>Save the Yellowstone Grizzly - fights for the safety and welfare of all grizzlies south of Canada, and laying the groundwork for a large-scale grizzly bear ecosystem recovery area. <a href=\"https://savetheyellowstonegrizzly.org/%20\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">savetheyellowstonegrizzly.org</a></p>\n<p>Yaak Valley Forest Council - works for a wild Yaak through science, education, and bold action. <a href=\"http://yaakvalley.org/%20\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">yaakvalley.org</a></p>", "image_url": "https://assets.change.org/photos/2/bm/lb/gYbmlBWzhnjdkHz-800x450-noPad.jpg?1608775946"}, {"title": "Stop the Execution of Cory Johnson!", "description": "<p>ATTENTION! I know everyone’s still reeling from the death of Brandon Bernard, however there’s another issue! Cory Johnson is scheduled to be killed 6 days before Biden is inaugurated. Johnson was 1/3 crack cocaine dealers who was convicted in 1992, for a string of murders that claimed 10 lives in a 45-day period. Prosecutor’s have stated that he killed 7 people, in an attempt to expand gang-territory in Richmond, Virginia. HOWEVER Johnson is intellectually disabled, and after a 2002 Virginia case, the Supreme Court ruled it unlawful to execute a person who is of “such low intelligence that they can’t function in society”. Also, NO jury or court has listened to the evidence that his lawyers have presented to decide whether or not Johnson has an intellectual disability. Allowing Cory Johnson’s execution to go forward will be a GRAVE INJUSTICE.</p>\n<p>Johnson suffered a HORRIBLE, childhood, filled with mental, physical, and emotional abuse, along with neglect (which are all risk factors for intellectual disabilities). At 13 he was abandoned by his drug-addict mother to a residential facility for children with intellectual &amp; emotional impairments, because he could not learn, and she was not able to cope his limitations. He transferred from numerous schools, and homes until 18 where we was released from a similar facility, with zero life skills, no life structure/support, and overall a little to no chance at succeeding at life. There has been any other federal death penalty prisoner who has NEVER had a single evidentiary hearing in which they could present their intellectual disability evidence. Johnson’s execution should not proceed in the absence of fair &amp; thorough opportunity to present his evidence. Three experts in intellectual disability have also concluded that there is an OVERWHELMING amount of evidence to PROVE that Johnson IS intellectually disabled. Also, Johnson’s co-defendant Vernon Thomas, who was convicted of the same violent acts as Johnson (including 4 murders), was spared the death penalty because of his own intellectual disability.Mind y’all, there has NOT been a lame duck execution in the transition period since 1888-1889. Now under the Trump Administration, there will be 3+.</p>\n<p>I believe that Cory Johnson deserves to face punishment for what he’s done. HOWEVER I do NOT support him being put to death. Johnson has shown to suffer from intellectual disability, and he deserves the right for a jury to hear so. It’s illegal to sentence someone who’s intellectually disabled, &amp; if Johnson’s death is continued, that law will be broken.</p>", "image_url": "https://assets.change.org/photos/6/vq/yq/TzvQYqLceFiFKMI-800x450-noPad.jpg?1607678964"}, {"title": "Justice for Quawan Charles", "description": "<p>A 15 year old boy was found severely beaten and lynched in Louisiana. Please help find who did this and get justice for him. We will not let this go unnoticed, this boy NEEDS to receive justice and his murderers need to go to prison. He was only 15 and had his whole life ahead of him. There is absolutely no news coverage on this horrible</p>", "image_url": "https://assets.change.org/photos/5/co/rw/bacorWKMtiIFohb-800x450-noPad.jpg?1605115348"}, {"title": "Arrest Child Predator Richard Reiger", "description": "<p>My son, Tayvion, a 6yr old child, has recently become a victim of sexual assault by a 58yr old man. The man's name is Richard Reiger and he used his very own son to bait my child in as Tayvion &amp; his son was best friends.</p>\n<p>Over the summer, Tay spent a few nights at Reiger's house where Reiger took the opportunity to sexually assault him. Richard Reiger let it be known to a neighbor that he had been sleeping in the same bed as Tayvion and then he notified me about it and that is when I asked my son about what happened about his experiences at these sleepovers.</p>\n<p>Tayvion only told me so much but I reported it to the police in late September and he had his forensic interview October 21st. I do not wish to share explicit details but they were not limited to Reiger removing all of his clothing before climbing into the bed and Reiger putting his hands on my son. I later took Tayvion in for a forensic interview in which Tayvion gave more detailed information to the investigators so they know more about the actual assault than myself at this point.</p>\n<p>Tayvion has changed drastically and is now a depressed little boy that is now having panic attacks multiple times a week and is always angry. We are waiting for an intake counseling appointment to come up but that's not until late January.</p>\n<p>Here is where I NEED your help. Richard Reiger has NOT been arrested nor has he been charged with the sexual assault of a 6 year old child. Richard Reiger lives behind an elementary school where he has access to children every day. Reiger also knows where the victim lives and is a current gun owner until charged. When I call for answers to the case the only thing they will tell me is that it's under attorney review. It is now approaching 4 months since it had been reported to local authorities. The state of North Dakota has picked up charges on relatives and on myself within a matter of 1-2 months (bogus charges but that's not what's important here) but has yet to protect the children of this state from a dangerous sexual predator.</p>\n<p>We demand they arrest 58yr old Richard Reiger for the sexual assault of 6 year old Tayvion. We need the help of the people in order to get this petition to the right people. We ask that you please sign as well as share so we can secure an arrest and get justice for Tayvion as well as protecting other children from this disgusting man.</p>\n<p>Thank you!!!</p>", "image_url": "https://assets.change.org/photos/4/fi/fd/kWFIfdrAGUpDVAt-800x450-noPad.jpg?1609611353"}, {"title": "Recall Liz Cheney", "description": "<p>Liz Cheney does not speak for the people of Wyoming we have had enough of these swamp people this petition might not do much but maybe it will tell her we will not sit by and take it anymore&nbsp; &nbsp; &nbsp;PLEASE DO NOT SEND MONEY IT GOES TO CHANGE.ORG .....NOT ME&nbsp;</p>", "image_url": "https://assets.change.org/photos/6/eu/fk/nLeuFKVidAMZbYl-800x450-noPad.jpg?1610504640"}, {"title": "Against the Reinstating of Aurora Police Officers in the Elijah McClain case!", "description": "<p>The three Aurora police officers who were fired for mocking Elijah McClain’s death in a smiling chokehold selfie near the site where he was attacked by police, are trying to get their jobs back.&nbsp;</p>\n<p>These three officers will go in front of the Aurora Civil Service Commission to appeal their terminations and ask to be reinstated. <strong>The sheer lack of respect for human life makes them a danger to the public and they should not be police officers.&nbsp;</strong></p>\n<p>23-year-old Elijah McClain died on Aug. 27, 2019 – five days after being placed in a chokehold and injected with ketamine in a confrontation with police officers. He was detained after a report of a “suspicious person” in the area, but had committed no crime and was walking back home from buying an iced tea.&nbsp;</p>\n<p>Just two months after he died, Erica Marrero, Kyle Dittrich, and a third Aurora police officer took a photograph at a memorial to McClain near the site where he had been detained, smiling broadly and reenacting a chokehold. Jason Rosenblatt, who was present on the night of McClain’s encounter with police, responded in a text to the photo, “haha”.&nbsp;</p>\n<p>These are supposed to be those that “serve and protect” the most diverse community in Colorado. Random acts of violence know no affiliation. Regardless of the aisle, you sit on, we can all agree that a man walking home from the gas station shouldn’t be subject to murder and after not committing any crime.&nbsp;</p>\n<p><strong>Elijah McClain was a son, a brother, a friend, and a light in our community. Many of us are still grieving, but we always put in the work.</strong> I’m asking everyone else to participate in the change that needs to happen. That young man was a majestic unicorn in the valleys.&nbsp;</p>\n<p>If these officers are reinstated it will let the world know that Aurora, CO does not want justice to be served for the death of Elijah McClain. Aurora Police Department will be letting down Elijah McClain's family, his friends, and all those who stood up with love and support.&nbsp;</p>\n<p>Unlawful force by police can also violate the right to be free from discrimination, the right to liberty and security, and the right to equal protection under the law. <strong>Therefore, we the people are saying, NOT to reinstate these officers.</strong>&nbsp;<br><br>Darlene Jones and April Young&nbsp;&nbsp;</p>", "image_url": "https://assets.change.org/photos/4/uj/lp/GIuJLPBKsrhgCiE-800x450-noPad.jpg?1606263835"}, {"title": "Keep the San Diego Convention Center Homeless Shelter", "description": "<p>It is unconscionable to close<em> Operation Shelter to Home</em> at the Convention Center during a global pandemic and an economic crisis in the winter. <strong>We demand that the shelter at the SDCC remain open until the decision to close is made in the best interest of ALL San Diegans.&nbsp;</strong></p>\n<p><br>In April (2020), the city of San Diego took a historic step in addressing its long-standing homelessness crisis. Named <em>Operation Shelter to Home</em>, the city of San Diego converted two of the city’s major events centers, the San Diego Convention Center (SDCC) and the Golden Hall, into shelters for our neighbors experiencing homelessness. There are now plans in place to <strong>close down the shelter</strong> (currently covering 1200+ individuals) at the SDCC on <strong>December 31st, 2020</strong>. We, the Mustard Seed Project, along with our fellow community members and concerned San Diegans, believe that this decision was not made in the best interest of our community. This shelter at the SDCC has proven to be extraordinarily successful in the ways it has supported our city and the people who make it America’s Finest City.&nbsp;</p>\n<p>The initial reason SDCC was explicitly chosen to be used as a shelter is due to its <strong>large occupant capacity</strong> and <strong>physical space for social distancing</strong>. Most other shelters in San Diego are currently operating at half capacity, with hardly enough space to social distance (Shelter beds at Newton Ave. are only 3 feet apart). Our community was able to come together and collaborate with one another to provide the safest streamlined services to support our unsheltered community. With help from Father Joe’s Village, The Alpha Project, and Veteran’s Village of San Diego, the SDCC was able to provide not only basic needs like food, showers, bathrooms, laundry services, and sanitary living spaces but able to go above and beyond in its mental and behavioral health services as well as daily health screenings. Furthermore, the coordination of numerous homeless services in a single location has also proved to be immensely successful. Since its inception in April, we have seen a collaborative effort to centralize services like SSI, State ID, and many others. <strong>This consolidation of resources has more than proven its effectiveness, resulting in over 700 housing vouchers, 332 permanent supportive housing units created, and numerous other successes.</strong></p>\n<p><em>In light of the pandemic, widespread economic crisis, the winter season, and the need for continued progress, we make the following demands:</em></p>\n<ol>\n<li><em><strong>Keep the Operation Shelter to Home shelter open at the San Diego Convention Center until San Diego is able to reach the Yellow Tier for a minimum of 5 weeks.</strong></em> It is unconscionable to close Operation Shelter to Home at the Convention Center while the fatal threat of COVID-19 is only increasing.</li>\n<li><em><strong>Increase funding for social workers, permanent supportive housing, and expanding access to sanitation.</strong></em> In order to best support our community, our supportive services, local grassroots organizations, and resource providers need access to adequate funding so that they can best support our city.&nbsp;</li>\n</ol>\n<p>Image Credits: <a href=\"https://www.kpbs.org/news/2020/nov/12/san-diego-city-college-class-trains-homeless-servi/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://www.kpbs.org/news/2020/nov/12/san-diego-city-college-class-trains-homeless-servi/</a></p>", "image_url": "https://assets.change.org/photos/8/cf/tu/ThcFTUyZjzKlgoh-800x450-noPad.jpg?1606126070"}, {"title": "Remove Cory Johnson from Death Row and Prevent His Scheduled Execution", "description": "<p>On November 20th, Attorney General William Barr scheduled the execution of Cory Johnson at the United States Penitentiary in Terre Haute, Indiana in <a href=\"https://www.justice.gov/opa/pr/executions-scheduled-inmates-convicted-brutal-murders-many-years-ago#:~:text=Johnson's%20execution%20initially%20was%20scheduled,Complex%2C%20Terre%20Haute%2C%20Indiana.\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">this press release</a>.</p>\n<p>Johnson's attorneys, Ronald J. Tabak and Donald P. Salzman said \"Cory Johnson is a person with intellectual disability.\"</p>\n<p>The supreme court ruling&nbsp;<a href=\"https://en.wikipedia.org/wiki/Atkins_v._Virginia\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Atkins v. Virginia</a>, 536 U.S. 304 (2002) held that \"allowing the execution of mentally handicapped individuals violates the Eighth Amendment's prohibition of cruel and unusual punishments.\"</p>\n<p>The execution of Cory Johnson is unconstitutional.</p>\n<p>The case <a href=\"https://en.wikipedia.org/wiki/Hall_v._Florida\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Hall v. Florida</a>, 572 U.S. 701 (2014) specified the conditions to consider a criminal mentally handicapped as \"1.) “subaverage intellectual functioning,” meaning low I.Q. scores; 2.) a lack of fundamental social and practical skills; and 3.) the presence of both conditions before age 18.\"</p>\n<p>At the age of 13, Johnson was <a href=\"https://meaww.com/cory-johnson-cocaine-death-row-murders-executed-january-14-lawyers-intellectual-disability\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">abandoned by his mother</a> to a residential facility for children with intellectual and emotional impairments. At 18, the facility released him into society \"with no life skills, no structure or support\".&nbsp;</p>\n<p>His lawyers stated: \"Yet, despite compelling evidence demonstrating his intellectual disability, no jury or court has ever listened to the evidence at a hearing to decide if he has an intellectual disability.\"</p>\n<p>His execution is currently scheduled for January 14th.</p>\n<p>Attorney General William Barr: Do not proceed with the execution of Mr. Johnson until he has a fair opportunity to present evidence that he has a mental disability and that the execution is unconstitutional.</p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/8/oq/tw/zVoQTWGgCDgreOl-800x450-noPad.jpg?1607717246"}, {"title": "Justice for Eelam @ United Nations Human Rights Council Session 46", "description": "<p><strong>To:&nbsp;The United Nations and its Member States</strong></p>\n<p><strong>Re: UNHRC's 46th Session &amp; The New Resolution on Sri Lanka</strong></p>\n<p>We, the undersigned, who include representatives of the Tamil community as well as other interested organizations and citizens, speak on behalf of Eelam Tamils against whom the Sri Lankan state, state sponsored actors, and security forces have committed multiple acts of genocide from the time Sri Lanka gained independence to the present day. Sri Lanka committed the 21st century’s most heinous acts of genocide in the final phase of the war in 2008 and 2009.&nbsp;</p>\n<p>We call upon the United Nations and its Member States to:</p>\n<p>1. Firmly and unequivocally pass a time-bound resolution at the 46th session of the United Nations Human Rights Council mandating an <strong>international, impartial and independent investigation</strong> into the conduct of the Sri Lankan state and its occupying military during the final phase of the war, and into the ongoing acts of genocide and human rights violations</p>\n<p>2. Pass a resolution at the UN Security Council and/or General Assembly that is similar to the above resolution but additionally refers Sri Lanka to the<strong> International Criminal Court (ICC)&nbsp;</strong></p>\n<p>3. Act swiftly to severely punish those found responsible for <strong>acts of genocide or other abuses</strong>, and to instate a <strong>protection mechanism</strong> that will prevent a recurrence of genocide.</p>\n<p>We make this request noting that:</p>\n<p>1. The Sri Lankan state and its security forces stand accused of <strong>committing genocide against Eelam Tamils</strong>, and also of committing crimes against humanity, war crimes and numerous human rights violations against Eelam Tamils (<a href=\"https://www.justiceforeelam.org/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">see here</a>);</p>\n<p>2. Some of Sri Lanka’s worst atrocities were committed in 2009, when tens of thousands of Eelam Tamil civilians were massacred in a <strong>premeditated genocide</strong> with Sri Lanka deliberately understating the Tamil civilian population in the war zone (claiming 70,000, not 429,000, lived there) before cutting off food and medicine, and then obliterating the small patch where these hundreds of thousands of civilians had sought refuge, although the Sri Lankan government admitted that only a few hundred LTTE fighters lived there (<a href=\"https://digitallibrary.un.org/record/737299?ln=en\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">see here)</a>;</p>\n<p>3. <strong>146,679 Eelam Tamil civilians</strong> are as yet unaccounted for, after the last phase of the war, many having gone missing after being seized by Sri Lankan security forces (<a href=\"https://www.tamilnet.com/img/publish/2011/01/LLRCsubmission_by_MannaarDiocese.pdf\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">see here</a>&nbsp;or <a href=\"https://www.tamilnet.com/art.html?catid=13&amp;artid=33380\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">here</a>);</p>\n<p>4. Nearly <strong>12 years</strong> have passed since the above acts of genocide during which time no tangible progress has been made towards an independent investigation into the Sri Lankan security forces’ conduct, and the passage of time has assisted Sri Lanka to cover up its atrocities by destroying the evidence;&nbsp;</p>\n<p>5. In the last 12 years, Sri Lankan security forces have enjoyed <strong>total impunity</strong> and the Sri Lankan state has evaded accountability, setting a dangerous precedent for future acts of genocide not only in Sri Lanka but also, elsewhere;</p>\n<p>6. Acts of genocide <strong>continue to the present day</strong> with Eelam Tamils being targeted for abuses such as <strong>rape</strong>,<strong> destructive conditions of life</strong> (especially amongst the internally displaced), <strong>ethnocide</strong> and <strong>systematic ethnic cleansing</strong> of Tamils from their lands;&nbsp;</p>\n<p>7. The<strong> Nazi-type motivation for genocide</strong> (ideology that Sinhala people are a ‘chosen people’ and therefore superior, and Sri Lanka is their ‘promised land’ and Eelam Tamils a threat), and a supportive state apparatus, could trigger further acts of genocide against Eelam Tamils at any time;&nbsp;</p>\n<p>8. Any <strong>internal investigation</strong> of Sri Lanka’s conduct would be inherently <strong>compromised</strong>, as it would be tantamount to a crime’s perpetrator adjudicating on their own innocence;</p>\n<p>9. There can be <strong>no lasting peace or stability </strong>in the region&nbsp;without accountability and redress for the aforementioned international crimes against Eelam Tamil civilians.</p>\n<p><em>This petition has been put forth and spearheaded by the next generation of the Tamil diaspora. For more information, please visit <a href=\"https://www.justiceforeelam.org/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">justiceforeelam.org</a></em></p>", "image_url": "https://assets.change.org/photos/5/rv/xn/jYrvXnlMniluuIJ-800x450-noPad.jpg?1610146818"}, {"title": "DOJ Must Appoint a Special Counsel to Investigate Evidence of Biden Family Corruption", "description": "<p>There is substantial evidence, from documents and witness statements, that the Biden family, including President-elect Joe Biden, may have been involved in criminal activity involving, among other issues, foreign entities tied to Ukraine and China.</p>\n<p>Joe Biden's son Hunter has already acknowledged that he is the target of a FBI criminal investigation.&nbsp;</p>\n<p>A special counsel should immediately be appointed because the Justice Department (either under President Trump or soon-to-be President Biden) is conflicted in investigating any matter that could implicate President-elect Biden or his immediate family.</p>", "image_url": "https://assets.change.org/photos/5/va/vs/pgVAvSEmDAktCsv-800x450-noPad.jpg?1610766170"}, {"title": "Justice for a young man unfairly suspended while at home on a virtual class", "description": "<p>The suspension for this young man should be completely removed and expunged from his record. He's only a boy and should not be held to the same legal standard as an adult. Furthermore, the punishment is egregious and will likely follow him his entire life unless it is removed. Common sense should prevail in this case, not harsh punishment in order that adults may make a 'political statement' at his expense.&nbsp;&nbsp;</p>\n<p><a href=\"https://www.lawenforcementtoday.com/record-remains-for-child-suspended-for-bb-gun-seen-in-virtual-classroom/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://www.lawenforcementtoday.com/record-remains-for-child-suspended-for-bb-gun-seen-in-virtual-classroom/</a></p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/7/ft/my/uPFtmYOQBFSEUue-800x450-noPad.jpg?1607877451"}, {"title": "Save The Sharks", "description": "<p>My goal with this petition is to create awareness about sharks and hopefully create better laws to protect them. &nbsp;More than 100 million sharks are being killed every year for their fins. &nbsp;They have their fins cut off, and are thrown back into the ocean to die slowly. &nbsp;Sharks are needed in the world because they serve a massive part in our ecosystem. &nbsp;They balance out the oceans and remove the weak and the sick. &nbsp;They ensure species diversity. &nbsp;Their disappearance can set off a chain reaction throughout the ocean and even effect the people who are on the shore. &nbsp;Many shark species are being threatened with extinction because they don't have the chance to reproduce quick enough with the amount that are being killed each year. &nbsp;Sharks are “functionally extinct” in one of five of the worlds coral reefs. &nbsp;This finning of sharks will affect the environment, and the food chain massively. &nbsp;Keep our sharks safe and in the water where they belong. &nbsp;Every signature helps and is beneficial to helping these magnificent creatures repopulate and get off of the endangered list. &nbsp;It is estimated that by 2040 sharks will be completely extinct. &nbsp;Lets help reverse this, and change the world one step at a time. &nbsp;Save the sharks.</p>", "image_url": "https://assets.change.org/photos/8/af/qk/QuaFqkKSlzPkVpY-800x450-noPad.jpg?1605915788"}, {"title": "STOP NYS Parks from Euthanizing/Relocating Feral Cats", "description": "<p>New York State Parks, Recreation and Historic Preservation has decided to take it upon themselves to decide the fate of feral cats that have lived in there homes in the parks for several years. It was brought to our attention that New York State Parks is currently trying to force the hand of rescuers and colony caretakers to remove, relocate and/or euthanize feral community cats. All cats have been TNR'd (Trapped, Neutered, Vaccinated and Returned) and do not pose a risk to any wild life or people in the park. The cats are fed on a daily basis and provided adequate shelter. The environments stay clean and the colonies are managed.&nbsp;</p>\n<p>Feral cat caretakers are tired of the constant battle we have to fight all too often for innocent animals. The New York State Parks department and the rest of the anti-feral cat community should not be going after the caretakers and the feral cat trappers of the world. This is not the fault of compassionate people. This is the fault of our municipal shelters for allowing the feral cat population for getting out of hand. Additionally, this is New York State Parks fault for not protecting the parks and keeping them from being a dumping ground for cats. The solution is not to relocate feral cats every time there is an issue. The solution is TNR! That same solution has been proven affective time and time again. When will those studies start to matter in the eyes of the law?</p>\n<p>PLEASE STAND WITH US AND HELP FIGHT FOR FERAL CATS!! NOT JUST FOR THE CATS AT THE PARK BUT FOR ALL FERAL CATS THAT WILL NEED SUPPORT IN THE FUTURE!</p>\n<p>THANK YOU!!</p>\n<p>TNR Taskforce, Inc.</p>", "image_url": "https://assets.change.org/photos/6/yx/ku/gIYXkuORcsDtBPV-800x450-noPad.jpg?1606529898"}, {"title": "Advocate Children’s Rights in Domestic Violence Abuse Situation", "description": "<p>Let’s raise awareness to this domestic violence situation in Dade City, Florida. Please sign this petition to advocate for children Dania Rich, Dillon Rich, and Katia Rich. These poor children have been failed by our justice system. They are constantly begging the police not to take them to back their abusive white father but unfortunately, the courts have rewarded their abusive father with majority custody. This court has ignored the domestic violence abuse to go against a woman of race and color. She has escaped her abuser’s grasp but her children have not. </p>\n<p>Out of all the black eyes and bruises their struggling mother has endured, the worst pain she has said to deal with was watching her children being ripped away from her and into the hands of her abuser. What kind of message does this send to the children of America about our justice system and constitutional rights?&nbsp;<br><br></p>\n<p>This court in Dade City has continued to take importance of their racist and sexist views while ignoring the wishes of the children and their mother in a domestic violence situation. By signing this petition, you are calling upon the duty of the state of Florida governors to hear your voice and let the voices of children be heard. Regardless of your political stance, we hope you can find it in your heart to listen to and protect children from this gruesome violence.</p>", "image_url": "https://assets.change.org/photos/3/dd/zy/epDdzysCQkXEwLw-800x450-noPad.jpg?1606935500"}, {"title": "SAVE PUVUNGNA FROM BEING DESTROYED", "description": "<p>Puvungna, a sacred site for indigenous people in Long Beach, . , where indigenous human remains and artifacts have been found. the goal is to get as many signatures as possible and to take this up with faculty at CSULB. Annual pow wows are held at this site. it is an extremely important place for Native Americans in our area. PLEASE SHARE AND SIGN.&nbsp;</p>", "image_url": "https://assets.change.org/photos/9/hh/uo/HuhHUOaIOzUBOKL-800x450-noPad.jpg?1607195062"}, {"title": "Rescue of neglected pitbull", "description": "<p>I’ve known about boss for about a week and a half now. I found out that one of my grandmas “tenants” had a dog down on a lot of land they’re “supposedly” renting from her. I asked the owners of the Boss if I could go down and give him water and food and meet him. Because I’m an animal lover (especially pitbulls).</p>\n<p>After going down to the lot I found that boss was 90% staying outside. When I first saw him he was very timid and tried to seek shelter under a very small tree (which offered him no shelter from the weather. After getting boss to warm up to me he immediately turned into the most warm and kind pup ever. It was overwhelmingly clear to me that the dog was shown little to no attention. He acted like he hadn’t been giving a good scratch’n in a very very long time. His (log) chain was attached to an old gate put up by my grandfather a long time ago, And he had about 10ft of space to roam. The only shelter available to him was a small “dog house” that clearly could not withhold rain. With no door, and straw as the “bedding”. (Keep in mind it was 38F° And raining the first time I saw Boss. He had no water in his water bowl and no food in his food bowl. The only food available to him was a bag of (damp) dry dog food inside the trailer. ( the owners knew I was going to feed the dog) (with evidence and witness’s).</p>\n<p>&nbsp;After asking someone (who had been attempting to collect rent from these people) &nbsp;for a while now how these people treated Boss. She went on to tell me how on multiple occasions she has had to go down and feed Boss. She also mentioned one occasion where they were asked to bring boss to our house because the man that also claims ownership of Boss was “beating him.</p>\n<p>&nbsp; &nbsp;There have been many people in the community who have told me that Boss isn’t the first animal they have neglected like this.</p>\n<p>After taking into my own hands and removing Boss from that space. I was arrested and charged with a misdemeanor 1 count of petty theft. And have spent 72 hours incarcerated because of it. I am now facing up to 6 months in jail and 2 years of probation.</p>\n<p>If you’d like to see Boss’s story. You can watch it from the beginning on my TikTok (jay.plvg). Or look for the hashtag #saveboss. Also links to donate to help me help boss are all in my bio there as well. My goal is to have boss rescued and put in a loving and caring home. For charges of neglect and animal cruelty brought upon&nbsp;his “owners” Also to have the charges against me dropped considering I was acting in the best interest of boss removing him from those conditions.&nbsp;</p>", "image_url": "https://assets.change.org/photos/9/ja/io/HujaiOjdIwkRXZM-800x450-noPad.jpg?1603234639"}, {"title": "Madison Cawthorn Must Resign", "description": "<p>Madison Cawthorn has repeatedly called for action by his supporters in WNC and all over the country to \"fight back\" and to join him in Washington DC on January 6th to \"stop the steal\". &nbsp;Because of his continuous calls for action, as well as spreading debunked claims about voter fraud, terrorists stormed the Capitol on January 6th in a failed coup. &nbsp;Federal property was stolen, destroyed, vandalized and sadly, 5 people lost their lives, including one Capitol Police Officer. &nbsp;</p>\n<p>Just days before the attack he gave a speech to an audience during a Turning Points encouraging them to threaten their local politicians and tell them they are coming for them. &nbsp;You can see more here-</p>\n<p><a href=\"https://www.google.com/amp/s/amp.dailycaller.com/2021/01/12/madison-cawthorn-officials-violence\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://www.google.com/amp/s/amp.dailycaller.com/2021/01/12/madison-cawthorn-officials-violence</a></p>\n<p>Cawthorn has&nbsp;also openly admitted to carrying a loaded weapon during the attack. You can see more here-&nbsp;</p>\n<p><a href=\"https://www.citizen-times.com/story/news/madison/2021/01/08/madison-cawthorn-says-he-armed-during-capitol-invasion-jan-6/6594808002/?fbclid=IwAR3D_aXEGpkPGbuDTtoCUseVBZXzmA4u2E1hj-lWRASuHc7eqd2SUNBpP-k\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://www.citizen-times.com/story/news/madison/2021/01/08/madison-cawthorn-says-he-armed-during-capitol-invasion-jan-6/6594808002/?fbclid=IwAR3D_aXEGpkPGbuDTtoCUseVBZXzmA4u2E1hj-lWRASuHc7eqd2SUNBpP-k</a></p>\n<p>We have to hold him accountable, this is not what we stand for as citizens of the United States and District 11 of North Carolina deserves much better representation.&nbsp;</p>\n<p><br>** We ask that you don’t donate money to this petition as we are not in need. **&nbsp;</p>", "image_url": "https://assets.change.org/photos/0/kg/zv/rLKgZVaGHYbYgya-800x450-noPad.jpg?1610676992"}, {"title": "Expel The Senators Who Tried To Overturn The Election", "description": "<p>6 Senators tried to overturn our free and fair election, culminating in the near overthrow of the federal government. The fanning of baseless conspiracy theories has destabilized our nation and weakened our country. Their actions are seditious and they must be expelled from Congress immediately.</p>", "image_url": "https://assets.change.org/photos/0/jv/bi/vHjvbiBeOhuIvAV-800x450-noPad.jpg?1610049023"}, {"title": "Trump Must Be Impeached and Removed From Office", "description": "<p>The acts of terror by insurrectionist rioters at the United States Capitol building in Washington, D.C. on January 6th, 2021 were incited by President Donald Trump.</p>\n<p>Trump's violent rhetoric has fully metastasized in the final days of his presidency when he urged his supporters to disrupt the certification of the 2020 Election results.&nbsp;<strong>Our democracy cannot afford another moment of his narcissistic recklessness.</strong></p>\n<p>Therefore, we are calling for:</p>\n<ol>\n<li><strong>Congressional leadership to pursue the immediate impeachment and removal of office of President Trump, and</strong></li>\n<li><strong>Vice President Michael Pence to begin the Constitutional proceedings to invoke the 25th Amendment.</strong></li>\n</ol>\n<p>Sign the petition and urge members of the United States House of Representatives, United States Senate, and the Office of the Vice President to remove Trump from office.</p>", "image_url": "https://assets.change.org/photos/4/fz/th/zRFztHfacKfWCcq-800x450-noPad.jpg?1609984891"}, {"title": "Stop Arctic Drilling, Save Polar Bears!", "description": "<p>Within weeks convoys of heavy trucks could be crushing polar bear dens in the Arctic Wildlife National Refuge. The trucks could scare mother polar bears into abandoning their dens, leaving their cubs to perish and sending the species into further decline.</p>\n<p>Undoing decades of federal protection, the Trump administration has moved to open more than 1.5 million acres of Alaska's Arctic National Wildlife Refuge to oil and gas drilling.</p>\n<p>This will spell disaster for a pristine wilderness that's home to polar bears, Arctic foxes, caribou and vast numbers of birds and other wildlife. It'll open up the region to devastating oil spills.</p>\n<p>The Southern Beaufort Sea polar bear population is the world's most imperiled, with as few as 900 individuals. The Arctic Refuge's coastal plain is vital to its survival. Oil and gas development there could eradicate polar bears from the region.</p>\n<p>This refuge is America's largest remaining stretch of pristine wilderness. If industry is allowed to turn the Arctic Refuge into an oilfield, exacerbating the climate crisis and wildlife extinction crisis, this rare and wild landscape will be forever scarred.</p>\n<p>The high cost to polar bears and the sensitive Arctic Refuge ecosystem just isn't worth it. The federal government must not allow harm to come to polar bears while looking for oil that Americans don't want the oil industry drilling for anyway.</p>\n<p>Stand up for the Arctic Refuge, polar bears and our climate.</p>\n<p><strong>Sign the petition now to tell the U.S. Fish and Wildlife Service to withdraw plans to auction off the Arctic National Wildlife Refuge to the oil industry.</strong></p>", "image_url": "https://assets.change.org/photos/7/no/cx/ZMnOcxcHLrnoQdV-800x450-noPad.jpg?1608055487"}, {"title": "We demand racial justice from Seattle Children's Hospital", "description": "<p>On December 31st, an article titled \"Revered doctor steps down, accusing Seattle Children’s Hospital of racism\" was published in <a href=\"https://crosscut.com/equity/2020/12/revered-doctor-steps-down-accusing-seattle-childrens-hospital-racism?fbclid=IwAR1-yuiIYbpjS9qNEbu-9toWO25og4FBB2OgSJBSojR6h9211jpXeI9U-UI\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Crosscut</a>. Dr. Ben Danielson is a highly accomplished and revered physician in the Seattle Area. He was the Medical Director at the Odessa Brown Children's Clinic located in the Central District of Seattle. “He was the face of equitable healthcare, and served generations of black and brown families”.</p>\n<p>The Odessa Brown Children’s Clinic exists today as a result of grassroots leadership by Black advocates and medical providers who organized to create the health care that local institutions long refused to provide. It is both a privilege and a responsibility for Seattle Children’s to steward that history. It should be honored through tireless, effective work to eradicate racism within the institution of Seattle Children’s and transforming health disparities impacting Black and Brown children and advancing and supporting the professional development and leadership of Black and Brown health care providers and other health care providers of color.</p>\n<p>Seattle Children's hospital needs to be held accountable for the racism and anti-Blackness that not only Dr. Danielson, but hundreds of families and staff have experienced within this institution. They need to work on addressing the issues described by Dr. Danielson AND make substantial changes that eliminate racism and anti-Blackness in every aspect of the Institution and leadership.</p>\n<p>We are concerned families, parents, stakeholders, providers, and community members. We demand answers and justice from Seattle Children's Hospital and to address the following:</p>\n<ul>\n<li>Holding racist providers and leadership accountable especially those that used the derogatory and anti-Black terms discussed in the Crosscut article</li>\n<li>An examination of why and when security was being called particularly on Black families, and a forced reduction in \"code purple\"&nbsp;</li>\n<li>An equitable and non-judgemental pathway for families, children, and youth to report racism with immediate and actionable steps</li>\n<li>Access to translation services mentioned in the Seattle Times and Crosscut</li>\n<li>Guarantees and protection especially for BIPOC staff to speak out without fear of retaliation</li>\n<li>A community drive approach to racial equity for and by community</li>\n<li>A recognition and apology of the harm caused to community, Dr. Danielson, his patients and all those impacted delivered by Dr. Jeff Sperring.&nbsp;</li>\n</ul>", "image_url": "https://assets.change.org/photos/6/qu/ex/OkqueXhkFQsHQxy-800x450-noPad.jpg?1609613214"}, {"title": "Make it illegal to house dogs outside 24/7 unless they are being used as farm dogs etc.", "description": "<p>Utah has harsh winters and many dogs can freeze to death if they don't have the right housing or coat type, many get frostbite. We have snow and our temperatures get below freezing throughout winter! Unless your animal is a farm hand or built to be out in the harsh winter conditions with appropriate housing to keep them warm and out of the elements!</p>\n<p>It is inhumane to leave your pet out 24/7 in the elements. Please sign to help the animals who can't speak for themselves!</p>", "image_url": "https://assets.change.org/photos/3/so/jp/pGSOJpamwSGfsfi-800x450-noPad.jpg?1602785486"}, {"title": "Justice for Animals in Avery County, NC", "description": "<p>PLEASE READ!!!! I NEED YOUR HELP!!!!! I have recently been in and around Avery County, North Carolina and have noticed the horrendous conditions that some of the animals in the town are living in. I saw dogs dead on the side of the road. Dogs without water or food. Dogs without shelter. Dogs limping and obviously hurt. Dogs who were shivering because of the below freezing temperatures. I even saw dogs locked in those metal hunting boxes and were left in there for hours in the freezing cold without food or water!!!!! It was clearly animal abuse and neglect which is illegal in NC so why is nothing being done?? The picture attached to this petition is a picture of one of the injured dogs and the dog locked in the metal hunting box.&nbsp;</p>\n<p>I made a complaint to the Avery County Sheriff's Office and the officer said they would \"try\" to check out the complaint but that they had \"more important calls\" to take first. After doing more research on what I can do to help these animals, I discovered that Avery County IS THE ONLY COUNTY IN NC WITHOUT ANIMAL CONTROL RESOURCES!!! I also found out that the cops have known about the specific incident I called about for OVER A YEAR and have done nothing. Many people who live in Avery County have reached out to me with similar complaints about animal abuse and neglect and the cops allowing it to happen for the \"hunters\" in the community. Regardless of the hunters, animal abuse is still animal abuse and the cops should be doing their jobs!!!&nbsp;</p>\n<p>I am compiling evidence and signatures to try to do something to save the animals in this town, hold the people accountable who are neglecting or harming these animals, and also prove the need for animal control in Avery County as Avery County is the only county in NC without animal control resources!! Please consider signing this petition, it would help me get some justice for these innocent animals and possibly prevent this from continuing in Avery county. If anyone has any connections, resources, advice, or evidence, please reach out to me!!!!!</p>", "image_url": "https://assets.change.org/photos/1/bb/qi/WhBBQiebwTKamMl-800x450-noPad.jpg?1607802119"}, {"title": "REMOVE ANTI SEMETIC  AUSCHWITZ HATEFUL T-SHIRTS FROM ONLINE STORE", "description": "<p>This horrible website is trying to make a profit off of selling this hateful antisemitic pro-holocaust shirt that was seen in the riots! For the sake of all the survivors and their families, please take it down and stop profiting off of hate!</p>\n<p><a href=\"http://Www.teehands.com/product/camp-auschwitz-shirt-work-brings-freedom-t-shirt\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Www.teehands.com/product/camp-auschwitz-shirt-work-brings-freedom-t-shirt</a></p>", "image_url": "https://assets.change.org/photos/6/lf/ov/BnlfovMlHKRpYKi-800x450-noPad.jpg?1610136605"}, {"title": "Justice for Corinne Comperchio Flynn", "description": "<p>Gerald Craffey raped and brutally murdered Corinne Comperchio Flynn by stabbing her 6 times. Corinne was a single mother who suffered from multiple sclerosis and weighed no more than 90 lbs. On the night of August 25,1991 Craffey, a family friend, used a ruse saying he needed to use the telephone in order to make his way into Corinnes home in Hyde Park.</p>\n<p>For four years after that heinous act Craffey helped Corinne’s family search for the murderer. He watched as the family was torn apart going to fundraisers; even helping hang signs for any tips about Corinne’s murder.&nbsp; Craffey frequently visited the family at their home in Roslindale where she grew up. &nbsp; He watched as the family suffered not knowing why or who took their beautiful young daughter, sister and mother from them.&nbsp; Before being caught for Corinne’s murder Craffey was a suspect in an attempted kidnapping as well as 2 separate sexual assaults all taking place in the Parkway area.</p>\n<p>In 1995 After relentlessly investigating the&nbsp; Boston Police cold case squad were able to link Craffey to the crime. A year later Craffey agreed to a plea bargain of life in prison with the possibility of parole after 15 years offered by the District Attorney.&nbsp; Corinne’s mother reluctantly agreed to the plea deal because she did not want to put her family, especially Courtney now being 14 years old&nbsp; through a long drawn out trial which would relive all the pain and anguish. She believed there was no way anyone would grant parole for such a horrific crime.</p>\n<p>To release a monster like this into the public where he would be free to stalk his next victim would be a mistake that only hurts the public. Craffey is not just threat but he is a predator, his prey are small frail women who cannot defend themselves.</p>\n<p>Corinne’s family will never get to see her again, her grandchildren will never get the opportunity to meet her.&nbsp; What Craffey did not only destroyed a family but his acts have and will affect that family for generations. This nightmare will never end for the Comperchio/Flynn family. They repeatedly go before the parole board every few years and relive all the heart breaking details in order to keep this monster behind bars.</p>\n<p>Please sign this petition and help make sure this animal never walks a public street again. Help prevent another family from having to live through a nightmare that never ends.&nbsp;</p>", "image_url": "https://assets.change.org/photos/1/ve/ik/LKVEIKBhrJAAWMV-800x450-noPad.jpg?1610210987"}, {"title": "The time to EXPEL Sen. Josh Hawley - MO from the United States Senate is NOW!", "description": "<p>The time to EXPEL Missouri Sen. Josh Hawley from the Senate has come.&nbsp;</p>\n<p>1) Missouri Republican Sen. Josh Hawley should be immediately EXPELLED from the U.S. Senate.&nbsp; He has violated his oath, stoked a violent mob of domestic terrorists and attempted to tear down our democracy.&nbsp; Hawley was soliciting campaign funds while our nation's Capitol was under attack and people were dying.&nbsp; He is a despicable, self-serving, deplorable, insurrectionist.</p>\n<p>2) As reported in the KC Star, Missouri Republican Sen. Josh Hawley became the first senator to say he’ll object to the certification of President-elect Joe Biden’s Electoral College victory when Congress meets on Jan. 6 to accept the results of the presidential election.</p>\n<p>Hawley cited unsubstantiated claims of voter fraud and accused the state of Pennsylvania of failing to adhere to its election laws by extending the deadline for mail-in ballots, an argument that has repeatedly been rejected by federal courts.&nbsp; He held up the Electoral College Vote Certification process twice with his unfounded conspiracy theories, offering zero evidence to support his claims.</p>\n<p>3) Josh Hawley lied when he tweeted that a \"candle-light vigil for democracy\" at his home in Virginia as \"Antifa scumbags came to our place in DC and threatened my wife and newborn daughter, who can’t travel. They screamed threats, vandalized, and tried to pound open our door.\"&nbsp; Video evidence shows that nothing of the sort happened.&nbsp; The dozen or so protestors chanted, sang and prayed outside his home, but exhibited no violence, threats or vandalism of any sort.</p>\n<p>4) Sen. Josh Hawley doesn't even live in Missouri.&nbsp; A review of property records shows that the first-term Republican is no longer a Missouri homeowner and that he is registered to vote at his sister’s home in Ozark, MO, while he is in-between homes in the state. He has alternately told the press he is living with his parents in Springfield, MO.</p>\n<p>Hawley owns a $1.3 million house in the Northern Virginia suburbs of Washington, D.C., where he spends most of his time with his wife, Erin Hawley, and their three children.</p>\n<p>5) Two separate MO audits found that in Hawley's short tenure as Missouri’s attorney general there were many paperwork and management problems that may have cost taxpayers unnecessary amounts of money.</p>\n<p>Taxpayer-paid staff working in former Attorney General Josh Hawley’s office met with his political consultants, perhaps more than a dozen times, in the months before he launched his U.S. Senate campaign in 2017.</p>\n<p>Several instances of travel related abuses noted that Hawley used a state vehicle and a driver for some trips without documenting the purpose of the trip. One cited example was that a driver told the auditor that on Dec. 16, 2017, he drove Sen. Hawley and his wife, Erin, to Kansas City for a Chiefs football game.</p>\n<p>6) Former U.S. Sen. John C. Danforth on Thursday, following the domestic terrorist attacks on the U.S. Capitol building, said to the St. Louis Post-Dispatch: \"Supporting Josh&nbsp;and trying so hard to get him elected to the Senate was the <em>worst mistake I ever made in my life</em>. Yesterday was the physical culmination of the long attempt (by Hawley and others) to foment a lack of public confidence in our democratic system. It is very dangerous to America to continue pushing this idea that government doesn’t work and that voting was fraudulent.\"</p>\n<p><strong>Josh Hawley is seditious and self-serving. Hawley has blood on his hands for fomenting rioting at the U.S. Capitol. He is dishonest and is not upholding the oaths and ethics of his elected offices. Sen. Hawley tried to subvert and undermine the Will of the People by overturning the results of the 2020 Presidential Election. Time to EXPEL Josh Hawley.</strong>&nbsp;<strong>NOW!</strong></p>", "image_url": "https://assets.change.org/photos/3/dc/qs/slDCQsFZDFPuEgN-800x450-noPad.jpg?1610060469"}, {"title": "Rep. Lauren Boebert must resign for her support of the violence and sedition on Jan. 6th.", "description": "<p>With less than one week in office, &nbsp;Rep. &nbsp;Boebert has betrayed the trust of Colorado and Americans for supporting the riot, violence, and sedition that took place in the Capitol on January 6. Specifically, she voted to reject the electoral college certification of a free and fair election. She is not fit to serve the people of Colorado with her extremist views. The people will accept her resignation and move forward with a representative who is better fit to serve our state and country.</p>", "image_url": "https://assets.change.org/photos/3/mm/wg/xImmwgbARWVqZst-800x450-noPad.jpg?1610127156"}, {"title": "Steve Daines Should Resign", "description": "<p>In a violation of his oath of office, Montana Senator Steve Daines aided and abetted an effort to overturn the will of the voters, empowered a President who has repeatedly broken the law and violated the norms of our constitutional democracy and fueled conspiracy theories that have inflamed the minds and spirits of terrorists.</p>\n<p>The result of his cowardice is being seen in Washington, D.C. today, where members of Congress were huddled in prayer and guns were fired in the United States Congress after a Trump-inspired mob stormed the seat of American democracy.</p>\n<p>If he had an ounce of decency left, Senator Daines would apologize for his actions, repudiate the President, and resign, but I think we all know how unlikely that is. While the Supreme Court has never ruled on the recall of members of Congress, we can at least send our message to Senator Daines that we will not be represented by someone who supports insurrection and terrorism.</p>\n<p>Senator Daines, do the right thing. Leave office. Montana deserves better.</p>", "image_url": "https://assets.change.org/photos/9/qj/ds/PcqjdSvOFisBRFj-800x450-noPad.jpg?1609965575"}, {"title": "Hold Rudy Giuliani Accountable", "description": "<p>\"President Donald Trump and his supporters gathered at the “Save America” rally in Washington D.C. on Wednesday to protest the election results they claim, without evidence, was stolen. The demonstration was timed to coincide with the formal&nbsp;electoral vote count&nbsp;in Congress scheduled for Wednesday afternoon. Among the speakers addressing the raucous crowd was Rudy Giuliani, the president’s personal attorney and face of his failed legal effort to challenge the election results in court. The former New York mayor walked on stage to “Macho Man” before calling on Trump supporters to settle the dispute over the election via “trial by combat.” Giuliani then assured the thousands of protesters that he was “willing to stake my reputation,” on the existence of election-altering fraud at play, ignoring the fact that such unfounded claims have repeatedly been laughed out of court. “And if we are wrong we will be made fools of,” Giuliani continued as if that ship had not already sailed.\"&nbsp;<em>NYMag, Watch Giuliani Demand ‘Trial by Combat’ to Settle the Election.&nbsp;</em></p>\n<p>On January 9, 2021, the President's personal lawyer called for \"Trial By Combat.\" Incitement is NOT protected by the First Amendment's freedom of speech. This is a clear call for violence against adversaries. Not only is this conduct deeply UNAMERICAN, but it also is NOT fitting of ANY lawyer. We call for the American Bar Association to disbar and seek action against Rudy Guilliani for his Anti-American conduct and conduct deeply antithetical to what the protectors of the constitution&nbsp; -- lawyers-- must do. We seek to heal these wounds by holding all of those accountable, and Rudy Guilliani SHOULD NOT GET A PASS.&nbsp;</p>", "image_url": "https://assets.change.org/photos/5/gc/rf/WlgCRFntOqXZEaP-800x450-noPad.jpg?1610043720"}, {"title": "Justice for Dolal Idd", "description": "<p>Dolal Idd was shot and killed by police near the same place Geroge Floyd was killed. Idd, 23, was Somali American and lived in the Twin Cities suburb of Eden Prairie. His father told the Sahan Journal that Idd was taking classes at Normandale College.</p>\n<p>Idd “was a family man, loved by his folks and his friends. Only god knows the pain everyone is feeling today,” said Abdirahman Warsame, who organized a GoFundMe pageto help pay for the family’s funeral costs.</p>\n<p>According to Minnesota Bureau of Criminal Apprehension records, Idd had been convicted of five misdemeanors and two felonies. Records show that he was jailed for possession of marijuana, carrying a firearm without a permit, theft, his involvement in a traffic accident, fleeing a police officer and giving a false name to a police officer. He was just finishing a three-year probation, his father said.&nbsp;</p>\n<p>In an incident from 2018, police say Idd, then 21, fired a gun in his family’s basement while two younger children were sleeping on the same level, according to Southwest News Media.&nbsp;</p>\n<p>His family is burying Idd on New Year’s Day, said Jaylani Hussein of the Minnesota chapter of the Council on American-Islamic Relations.</p>\n<p>Officers were executing a traffic stop, which took place at the Holiday gas station at 36th Street East and Cedar Avenue in south Minneapolis, as part of a “probable cause” weapons investigation. But he didn’t offer more specifics about it. A police spokesperson earlier said that the victim was suspected of a felony. Officers recovered a weapon at the scene. It’s still unclear if Idd shot at police at all because of only one video of body cam footage was released. POLICE SHOULDNT USE DEADLY FORCE!</p>", "image_url": "https://assets.change.org/photos/2/wb/dp/sCWbDpMoxJMmagv-800x450-noPad.jpg?1609625718"}, {"title": "Take Dustin John Higgs out of Death Row", "description": "<p>Dustin John Higgs was accused of murdering 3 girls but he was later on found that he was not not guilty. But he is still in prison only because they say that he was at the scene of the crime and had bullied Willis Hayes into killing the three girls. Willis Hayes (who DID commit the crime) said that this was not true.&nbsp;Dustin John Higgs is in prison for a crime he didn’t commit. So can you please help me to free this innocent man. Let’s please not let the same thing happen to him like how it happened to Brandon. His execution date is on January 15th.</p>", "image_url": "https://assets.change.org/photos/8/dn/mp/nlDNmpSSLgVeDKI-800x450-noPad.jpg?1607710218"}, {"title": "Eliminate Riley’s Farm as an approved LAUSD Field Trip Site", "description": "<p>Riley’s Farm is currently approved on the LAUSD list of field trips. &nbsp;Jim Riley, owner, is a known racist and most recently took part in the January 6th, 2021 insurrection at the US Capitol Building. &nbsp;LAUSD should not approve field trip sites that use our taxpayer dollars to perpetuate racism. &nbsp;</p>", "image_url": "https://assets.change.org/photos/0/wd/na/xxWDNAtQKfmzskJ-800x450-noPad.jpg?1610146688"}, {"title": "Let's Let Kobe Begin His Life", "description": "<p>By a stroke of fate, I met Kobe from an online correspondence program with people who are currently incarcerated. I was really curious how people in prison were feeling during this time in our world. I am currently a junior studying social work, and I was really interested in learning more about criminal justice and the prison system in our country. I sent out a letter introducing myself, and hoped he would write me back. He wrote back immediately, sharing all about his past with an open heart and honest words. We started writing to each other every week, and soon for me it became less about the prison system and more about the cycle of vulnerability people of color experience in our society. His parents weren't exactly always providing support, unfortunately they had struggles of their own- the system had failed them too. He shared with me that when he was thirteen, he was passed around to his uncle because his mom could not take care of him. He had bounced around the foster system, but eventually his uncle offered to have him come stay. He was taught how to sell drugs and make money quickly. He was thirteen. My little brother is fifteen, and I could never imagine him transferring from one temporary family to the next, and then getting a lesson from the main male figure in his life how to make a living, illegally.&nbsp;</p>\n<p>I believe that Kobe’s bunk bed in prison had his name on it since the day he was born. I believe that the systems we have in place in our society failed him by a large margin. His situation made it clear to me just how privileged I am as a white person in our country. Kobe and I talk every day for an hour. It costs me about $12-$20 per day, but talking to him is like feeling a ray of sunshine after months of clouds. Seeing his face on the tiny grainy video screen is like getting a glimpse into the bright and shiny soul that is within him. Today on our video visit, he closed his eyes and took some deep breaths. He said he was trying hard to have faith, trying to keep his strength, but he wasn’t sure why “they needed to put me in here for so long.” If prison is supposed to be about rehabilitation, I need to know why this man’s life was taken away from ages 21 to 36. It doesn’t make sense to me how somebody with so much love, care, and incredible ideas is stuck behind a fence where they have to pay outrageous prices for phone calls, work full time to be making less than $1 an hour, isn’t eligible for any financial aid, and sleeps in a room with 100 other men.&nbsp;</p>\n<p>Kobe dreams of owning a food truck. He wants it to be southern food and he already has the whole thing drawn out and the menu decided. He wants to get his business degree so he can have an advantage when he’s out, as well as expand his knowledge of how to be a successful business owner. Kobe is an amazing artist. He draws this amazing detailed art on the outside of the envelopes he sends me, and recently I had the idea to turn these drawings into stickers to pay for his degree. It blew up and within 3 weeks he made enough to pay for his degree, which was full priced, because prisoners aren’t eligible for any sort of financial assistance.</p>\n<p>His smile could make anyone smile.</p>\n<p>His smile deserves to be seen.</p>\n<p>His smile and his light and his laughter and his joy deserves to be where people can hear him and see him.</p>\n<p>The color of his skin gave him an unfair disadvantage in this lifetime, and the least I can do is get his story heard.</p>\n<p>I have people from all different countries wanting to sign a petition to set Kobe free and get his life started. I don’t want him to have to wait 12 more years to start a food truck. I don’t want him to have to wait 12 more years to see his mom. I don’t want him to have to give away his books because he doesn’t have room under his bunk bed. He gave me his all-inclusive book wishlist the other day. It included titles like, “The New Jim Crow,” “History of African Americans,” “Awaken Your Third Eye,” \"The Science of Everyday Life,\" “How to Start and Run a Food Truck,” “Rumi’s Little Book of Love,” and countless other books that just prove how committed Kobe is to changing his life. He is committed to finding the way and the resources to becoming the best person he can be. He realized that he has options that he didn’t realize he had before. He was taught the only way to make money was by doing so the wrong way. He didn’t realize people would buy his art. He was never told that he was worthy or valid. He was never told that he could do anything he wanted. Nobody ever made that clear, in fact society did just the opposite. His closest circle taught him that he was unworthy: unworthy of success, unworthy of love, unworthy of happiness. He had that drummed into him since he was born, and then was expected to rise up despite the entire world relentlessly pushing him down. 12 more years trapped in prison is not the way for him to get started in his life. He is 23 years old. He is just getting his life started. He now knows what he is capable of.&nbsp;</p>\n<p>How can I show our state he will contribute more to society than the majority of the American population? He plans on becoming a motivational speaker. He plans on opening a nonprofit resource center for single mothers. He has so many things he wants to do, he draws up plans for them all day long.</p>\n<p>Are we going to make him wait another 12 years to get started? Or will we believe in him now? I am respectfully requesting we make this man’s dreams come alive by granting him clemency. He knows now that there are limitless other paths for him, and he is beyond excited to start living his life and break the relentless cycle of vulnerability.</p>", "image_url": "https://assets.change.org/photos/4/yn/ej/TdYnejVNCfNdtFO-800x450-noPad.jpg?1610082768"}, {"title": "I'm Not Leaving The University of Alabama", "description": "<p>On January 6th, 2021, I attended an event with the President of the United States, Donald J. Trump.&nbsp;For the past 4 years, I have been a loyal supporter of the President and his conservative agenda. And it was for this reason, I attended this event in our nation's capital.&nbsp;</p>\n<p>Shortly following the event, I - alongside many others - marched to the U.S. Capitol for a peaceful demonstration. But when this demonstration turned violent, I promptly left. And shortly thereafter, <a href=\"https://twitter.com/thecjpearson/status/1346928538973253632?s=20\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">I condemned the violence on social media</a>.&nbsp;</p>\n<p>However - for my support of the President and my participation in this mostly peaceful demonstration - a progressive student activist at my University, Dana Sheetz, is seeking my expulsion, claiming that I am a threat to the \"inclusivity\" of our campus. She, in addition, called me a supporter of violent acts I publicly condemned.&nbsp;</p>\n<p>This is bigger than politics. This is about freedom of speech. And I refuse to be bullied away from the University I love so much&nbsp;</p>\n<p>I will never be ashamed, nor apologize, for standing behind our President. Want to cancel me for that? I wish you the best of luck. A few bad apples don’t define a movement.</p>\n<p><strong>Stand with me.</strong></p>", "image_url": "https://assets.change.org/photos/7/ov/hx/FaOVHxPTGpUyfXQ-800x450-noPad.jpg?1610065854"}, {"title": "They are coming for me!", "description": "<p>Thank you to all those who have signed this petition. We now have over 22,000 signatures. There are others calling for his removal from office. We have been successful&nbsp;in putting pressure on him and those who have supported him.&nbsp;<br>He has lost his book contract with Simon &amp; Schuster. He is no longer supported by John Danforth who has said. “This is the worst mistake I have ever made.” &nbsp;He has lost his position teaching at the University of Missouri. His wife’s name has been removed from the website at the plush legal firm Kirkland and Ellis where she was employed. his fellow Yale classmates and over 20,000 lawyers have signed a letter to the Missouri Bar asking that he be disbarred. He has lost several of his major contributors.&nbsp;These are just the beginning. Keep up the pressure. This could have&nbsp;been prevented by an apology and changing his ways. He must know that there are repercussions for committing sedition and that he cannot cheat the people of Missouri. Thank you in advance.&nbsp;</p>\n<p>I can be reached at:</p>\n<p>The Rev. Mimi Savidge</p>\n<p>5700 NE Poplar Dr</p>\n<p>Kansas City, MO. 64118</p>\n<p>or via email:</p>\n<p>mimisavidge@yahoo.com</p>\n<p>or by texting &nbsp;(816) 832-3621</p>", "image_url": "https://assets.change.org/photos/5/nk/bq/GrnKBqKpObTBFpK-800x450-noPad.jpg?1610732904"}, {"title": "Chesterfield County Schools reinstate Wednesdays off &amp; give the option of pass/fail grades", "description": "<p>This is an official appeal for Chesterfield County Schools to give the collective student body Wednesdays off once again, as well as giving us the option of pass/fail grades for our mental health.&nbsp;</p>\n<p>Currently Chesterfield County schools believe pushing us to turn our cameras on and go to school for extra hours will help us succeed in school. However, it is quite the opposite. The more hours we are expected to sit and listen through each class, the worse our mental state is getting.&nbsp;</p>\n<p>We are unmotivated and tired. This environment is slowly killing our spirit and we must find a change. According to a report done by Richmond News on Monday, “one in six Chesterfield high school students are failing two or more classes.” The article goes into further detail about how students' mental health is struggling.&nbsp;</p>\n<p>The school board's taking away our mental health day is detrimental to many kids who need the break from the stressors of classes and focus on self care and time with family and friends- the healthy way to respond to a very stressful and for others painful year.&nbsp;</p>\n<p>The county as a whole is struggling to adapt to online, and adding stress to a global pandemic is not the answer.&nbsp;</p>\n<p>Therefore, for empathy and understanding for what students and teachers are currently going through; the collective student body is petitioning to reinstate Wednesdays as an official mental health day, and to present the option for classes to be pass/fail.&nbsp;</p>\n<p>Sign your name for the goal that the mental health of students will be put above everything else.&nbsp;</p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/5/db/zy/WNdbZYAxczrhowZ-800x450-noPad.jpg?1610488998"}, {"title": "Return to Original LCPS Distance Learning Schedule", "description": "<p>The students of Loudoun County, especially the senior class of 2021, are requesting that the LCPS administration does not move forward with the newly proposed second semester schedule. Students around the county are struggling with motivation to join classes and complete assignments, and adding on class time leaves students with less time for wellness breaks. Some students use their breaks to socialize, catch up on sleep, complete extra assignments, study, or do other activities that will help improve their mental health. Also, some students are responsible for caring for younger siblings, as some have parents who are essential workers, and these breaks give older siblings the ability to do so. The senior class is struggling with senioritis like never before, and a long lunch break to go see friends is sometimes the only thing we have to look forward to. This newly proposed schedule would also place extra work responsibilities on teachers who are already stressed. We know that hybrid learning is being put in place for the students who need it most, and continuing to have learning lab in school would allow students to ask more questions and get the help they need. The students of LCPS know that our administration wants the best for us, and sticking to the original plan would give students less stress than what is already on our plates.&nbsp;</p>", "image_url": "https://assets.change.org/photos/3/oq/bv/AlOqbVsUPupftqP-800x450-noPad.jpg?1610551174"}, {"title": "End the Cruel and Deadly Fur Trade, Before it Causes the Next Pandemic!", "description": "<p><em><strong>This petition is part of a global campaign initiated by the Fur Free Alliance.</strong></em></p>\n<p>The fur trade is a deadly business. Every year, around 100 million animals suffer and are killed for their fur. The vast majority are kept on intensive fur farms. Animals including fox, mink, raccoon dogs and chinchillas are kept for their entire lives in tiny wire cages, before being killed and skinned for so-called fashion.</p>\n<p>Not only do these battery cage systems cause immense animal suffering, they are also now proven to present a serious public-health risk. The cramped conditions, poor hygiene, stress, injuries and disease, minimal veterinary care, and lack of genetic diversity all mean that fur farms create ideal conditions for viruses to be transmitted, and for viruses to mutate creating new strains.</p>\n<p>Hundreds of mink farms in countries including the Netherlands, USA, Denmark, Sweden, Italy, France, Greece, Spain and Lithuania have been found to have animals infected with SARS-CoV-2, the virus which causes COVID-19. On farms in Denmark, the virus has already mutated into new strains, which have in turn infected people. Disease prevention experts have expressed grave concerns, including the European Centre for Disease Control who stated in a November report that the evolution of the virus in mink could undermine the effectiveness of future vaccines in humans. The report also found that “continued transmission of SARS-CoV-2 in mink farms may eventually give rise to other variants of concern”.</p>\n<p>Governments cannot respond to this crisis simply by culling millions of animals and then allowing farmers to return to business as usual. The appalling conditions on fur farms make them a ticking time bomb for pandemic disease risk. Disease transmission experts warn that it is a matter of when, and not if, another deadly virus hits if we continue to keep animals in conditions that push them beyond the limits of their physical and psychological endurance.</p>\n<p>Twenty countries have already acted to ban the farming of animals for their fur because it is cruel, outdated and unnecessary. In light of new evidence that fur farms can also act as reservoirs for deadly viruses, as well as create new viruses, we call on all countries to&nbsp;ban fur farms, and we call on G20 leaders to&nbsp;publicly acknowledge that fur farming must end.</p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/5/kl/ht/APklHTkmTGrswSA-800x450-noPad.jpg?1607111611"}, {"title": "Grey Wolves should be put back on the endangered species list.", "description": "<p>Wolves are intelligent sentient beings who need federal protection from deforestation and poaching. By taking them off the endangered species list, these vital keystone species will not receive the level of protection they should. As a result they’re numbers could drop again. Wolves have sting social bonds and are fiercely loyal and protective of their pack members. Entire packs of wolves have been killed by poachers. In the 1900s all of Yellowstone wolves were culled, even pups. As a result, elk and moose over grazed, killing off the next generation of trees. Birds left the park, as did beavers. Unkept ponds became fast flowing rivers killing off pond life. Wolves are crucial and must be protected. There are only about 20 red wolves left in the wild and around 160 Mexican Greys.</p>", "image_url": "https://assets.change.org/photos/5/kv/us/IRKvuSUwinzYirx-800x450-noPad.jpg?1604072635"}, {"title": "Demand U​.​S. Rep. Mary Miller(IL) Resign", "description": "<p>U.S. Congressperson <a href=\"https://twitter.com/Miller_Congress\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Mary Miller</a> (R-IL) has demonstrated an act of blatant antisemitism and disrespect to the Jewish people and all those who perished at the hands of the Nazis.</p>\n<p>A sitting member of Congress who uses Hitler’s obscene methods for indoctrinating children with racism and fascism as a guidepost, igniting hate and violence has no place in Congress.</p>\n<p><strong>Join us in signing this petition demanding her resignation.</strong></p>\n<p>Context: <a href=\"https://twitter.com/MarkMaxwellTV/status/1346870502388883457\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://twitter.com/MarkMaxwellTV/status/1346870502388883457</a></p>\n<p>Signed,&nbsp;</p>\n<p>The Illinois Legislative Jewish Caucus&nbsp;</p>\n<p>Illinois State Representative Jonathan Carroll</p>\n<p>Illinois State Representative Kelly Cassidy</p>\n<p>Illinois State Representative Margaret Croke</p>\n<p>Illinois State Representative Daniel Didech</p>\n<p>Illinois State Representative Robyn Gabel</p>\n<p>Illinois State Representative Jennifer Gong-Gershowitz</p>\n<p>Illinois State Representative Will Guzzardi</p>\n<p>Illinois State Representative Mark Kalish</p>\n<p>Illinois State Representative Bob Morgan</p>\n<p>Illinois State Representative Anna Moeller</p>\n<p>Illinois State Representative Sam Yingling</p>\n<p>Illinois State Senator Sara Feigenholtz</p>\n<p>Illinois State Senator Laura Fine</p>\n<p>Illinois State Senator Julie Morrison</p>\n<p>Illinois State Senator Ram Villivalam</p>\n<p>&nbsp;</p>\n<p>Chicago's 50th Ward Alderman Debra Silverstein&nbsp;</p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/2/nu/kn/AuNUKnlDsgUgcGL-800x450-noPad.jpg?1609972682"}, {"title": "PRESIDENT BIDEN: Award USCP Officer Eugene Goodman The Medal of Freedom", "description": "<p>We are Blue Revolution, a private group of 94,000 progressives. Join us here: <a href=\"facebook.com/groups/bluerev\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">facebook.com/groups/bluerev</a></p>\n<p>A mob stormed the US capital on January 6, 2021 and began marching towards the senate chamber. As the mob began to follow Officer Eugene Goodman up a flight of stairs, he noticed that the hallway to the senate chamber was unguarded. So he led the mob in the opposite direction, letting them chase him.&nbsp;</p>\n<p>At that moment, the senators and vice president had not yet evacuated the chamber. They very well could have been injured or killed by mob violence had Officer Goodman not led the mob in the opposite direction, letting them chase him.&nbsp;</p>\n<p>President Biden should award Officer Goodman the Medal of Freedom for his heroic actions.&nbsp;</p>", "image_url": "https://assets.change.org/photos/0/yz/sn/oOyzSNuIBtPxoPx-800x450-noPad.jpg?1610342292"}, {"title": "SAVE THE DOMES", "description": "<p>While it is great to see a new school built in Birdsprings to educate our youth, the original Little Singer School should not be destroyed.&nbsp; The original Little Singer School represents an amazing amount of technology, and compassion, from the inventor and creator, Thomas Lee Ryan, and his inspiration, the honorable Medicine Man, Little Singer.&nbsp; The school was built without original help from the BIA or BIE, strictly with private funds from Thomas Ryan's family, Dave Packard, students of Foothill College in California, and the elders and children of Birdsprings, Arizona.&nbsp;</p>\n<p>The school was unique in its dome construction, solar heating, and wind-powered electricity.&nbsp; Tom actually invented and patented the solar panels used at Little Singer School and other locations across the Navajo Nation. He created Birdsprings Solar company, training local Navajo to create these panels, bidding on government contracts and installing them at places like Chinle Indian Health Services Hospital.&nbsp;</p>\n<p>We are grateful that a new school expands the history of this great legacy into the future, but we would like to see the original buildings remain as a testament to the original plight of native children being sent to government boarding schools. This school speaks to the healing of bringing the children home to the community based on the dreams of Little Singer and Tom Ryan.&nbsp;</p>\n<p>We envision a space within the new school campus that the original domes could provide an additional educational experience to current students, especially those in native history, engineering, and mathematics.</p>\n<p>If we and the school board cannot find the space on it's campus for the original domes, we would like the opportunity to find a new location for the school. We would like to create an amazing interpretive exhibit, showing the history of Birdsprings, of government forces removal of school aged children to residential schools. The legacy of our people, the dreams of Little Singer to bring the children home, and how Little Singer found a quirky white guy that devoted his entire life to bring these children home needs to be saved for future generations.</p>\n<p>In the future we will be asking for funds to actually create or move this amazing historical opportunity.&nbsp; But for now, we must just stop the irreversible destruction of an amazing future archeological historical site.</p>\n<p>Please help my family and me to stop the destruction.&nbsp; We can deal with the rebuilding later.&nbsp; Thank you for listening.&nbsp; Please take care. Love from the Ryan Family.&nbsp;</p>", "image_url": "https://assets.change.org/photos/7/kl/ng/YlKlNgalobbOINS-800x450-noPad.jpg?1607155331"}, {"title": "Remove James Hoak", "description": "<p>Sierra Unified School District Trustee James Hoak participated in the attack on democracy and insurrection at the Capitol on January 6th. He uploaded videos on his Facebook and later deleted them, but not before USpark had received copies.&nbsp;<br><br>The community is outraged a Trustee would participate in an act of White Supremacy and Treason. We demand he be removed from his position at Sierra Unified School District. Decisions that impact children, especially children of color, should not be made by a White Supremacist. Remove Haok now!&nbsp;</p>", "image_url": "https://assets.change.org/photos/7/mv/mu/oBmvmUlrTgLolUO-800x450-noPad.jpg?1610247269"}, {"title": "Put Awstin Murawski in prison.", "description": "<p>Awstin Murawski r*ped his 5 year old sister when he was 17. Due to him only being 17, this did not get put on his record and he only went to juvie for a month(s). He has permanently scarred his little sister for the rest of her life and he contributes to pretend that he did nothing wrong and that he is the victim. That child will never heal from what Awstin did to her. He is now an adult and my goal is for the Michigan Justice System to deal with him properly if we make enough noise about it.&nbsp;</p>", "image_url": "https://assets.change.org/photos/6/hj/xt/PLhjxTTezTrkAxx-800x450-noPad.jpg?1610152157"}, {"title": "Answers on the disappearance of Moses Harris", "description": "<p>On the night of December 19, 2020 in Lowell, Massachusetts, Moses Harris jumped into the Concord River after being confronted by police officers. My family have not seen any body camera footage from the night, we haven’t been given clear answers as to why no one stopped him or protected him after watching him enter the river, and the last council he met with was police. The brief search for his body has been called off, local papers are giving ambiguous details about his case almost as if he is missing, with no Missing signs or Amber Alerts being issued up by the police. Lastly the police department have refused to grant our family the audience to meet with us and discuss his case.&nbsp;</p>\n<p>We ask for your support to pressure the Lowell Police Department to account for the life they took. We ask all those even if you aren’t from Lowell, Massachusetts to stand with us, this Holiday season because all we want is answers to why our angel went to Heaven so soon. Another black man life could have been taken and we refuse for this case to be swept underneath the rug. With all your support however that won’t happen.&nbsp;<br><br></p>", "image_url": "https://assets.change.org/photos/8/sq/uo/nvsqUOsxpBSqARZ-800x450-noPad.jpg?1608729358"}, {"title": "Demand Justice for Casey Christian Goodson Jr", "description": "<p>On <a href=\"https://abc6onyourside.com/news/local/officer-involved-shooting-in-north-columbus-12-4-2020\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Friday, December 4th</a>, 23 year-old Casey Christian Goodson Jr, was <strong>shot three times</strong> in the back and murdered by <a href=\"https://radio.wosu.org/post/franklin-county-sheriff-identifies-deputy-who-killed-23-year-old-casey-goodson#stream/0\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Franklin County Sheriff's Deputy Jason Meade</a>. <a href=\"https://www.dispatch.com/story/news/crime/2020/12/07/amid-questions-shooting-deputy-need-body-cameras-apparent/3857420001/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">The US Marshals were in Estate Place</a> in Northeast Columbus finishing up work <a href=\"https://www.usmarshals.gov/district/oh-s/taskforces/index.html\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">for the Southern Ohio Fugitive Apprehension Task Force (SOFAST)</a> when allegedly, according to police, Goodson Jr drove by waving a gun. However,<a href=\"https://www.facebook.com/kaylee.harper.7524\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"> Casey's sister refutes this</a>: Goodson Jr had walked across the yard, walked into the back fence to get to the side door, with his Subway sandwich and mask in one hand and keys in the other, unlocked and opened the door, and stepped in the house before being shot by police. Instead of leaving Goodson Jr alone, police killed Goodson Jr,&nbsp;<a href=\"https://www.facebook.com/kaylee.harper.7524\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">who was a licensed concealed carry weapon holder.</a> <a href=\"https://www.dispatch.com/story/news/crime/2020/12/04/utah-man-stopped-speeding-dec-2-had-loaded-gun/3827075001/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Just two days earlier in nearby Delaware</a>, Merak Burr, a white man, was pulled over for speeding. Instead of complying with officers, Burr became agitated and pulled out his gun, which he did&nbsp;<strong>not&nbsp;</strong>have a concealed carry weapons license for. In spite of this, Burr was initially let go but arrested&nbsp;<strong>two hours&nbsp;</strong>later.&nbsp;</p>\n<p>These stories elucidate a common occurrence in the United States: Black folx, especially Black Transgender folx,&nbsp;<a href=\"https://everytownresearch.org/report/gun-violence-and-the-police/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">are targeted and killed by police at disproportionate rates</a>. The murder of Casey Christian Goodson Jr cannot be swept under the rug as so many murders of Black and Brown folx, and the city of Columbus must continue to eliminate the issue of systemic racism through <strong>innovative</strong> and <strong>progressive</strong> strategies.&nbsp;</p>\n<p>We, the people of Columbus, demand that:</p>\n<p>1. The murderer of Casey Christian Goodson Jr be fired immediately.&nbsp;</p>\n<p>2. The murderer of Casey Christian Goodson Jr be tried for murder.</p>\n<p>3. Mayor Andrew Ginther and the Columbus City Council publicly condemn the murder of Casey Christian Goodson Jr.</p>\n<p>4. The negotiation of the Civilian Review Board and its components be transparent to the public, open to feedback from the people, and not be weakened by police influence.</p>\n<p>5. The City of Columbus and Columbus City Council defund the CPD and instead invest in solutions that <strong>root out systemic racism</strong> and <strong>empower communities</strong>, which have been advocated for by <strong>numerous</strong> grassroots organizations, such as BQIC, in Columbus.&nbsp;</p>", "image_url": "https://assets.change.org/photos/5/sm/rg/ulSmrgTeYmhtlNr-800x450-noPad.jpg?1607147886"}, {"title": "Elise Stefanik (R)  to resign from office as representative of New York’s 21st District", "description": "<p>Elise Stefanik (R- Schuylerville) objected to certifying the results of the 2020 Presidential election. She specifically questioned the legitimacy of the elections in Georgia,Pennsylvania, Wisconsin and Michigan without any just cause.&nbsp;<br><br>As an elected official Elise Stefanik selfishly used her public platform to fan the flame of Donald Trump and his supporters. She, and others will now feign naivete and shock at the domestic terror attack on our Capitol 1/6/2020. We will not let her get away with her insidious behaviour. <br><br>Representatives like Stefanik are elected to office to speak on behalf of their constituents and should not be permitted to usurp that given power and use it as a means to defy the US Constitution for their own gain. Stefanik, during her career has voted with Trump 77.8% of the time and continues to prove she is in his pocket.&nbsp;<br><br>The Constitution does not support objections to election results DESPITE how Stefanik twists the document's intentions. There is no justification, beyond selfish pandering, for her silence against Donald Trump and his insurrectious rhetoric. He and his supporters, including Stefanik, are the reason for the disgrace to our nation which took place against the Capitol. Her failure to speak out against,or fault Donald Trump even after the saddening display Jan. 6th further proves her unyielding support.<br><br>We will not let her continue to make a mockery of her elected office and demand she resign for her part in attempting to upend democracy.&nbsp;</p>", "image_url": "https://assets.change.org/photos/5/yr/hb/ZiYrHBdSjKwzKbS-800x450-noPad.jpg?1610029009"}, {"title": "Josh Hawley's Resignation or Expulsion From The Senate", "description": "<p>Josh Hawley, over the last ten days, has defended and advocated for protests in Washington D.C., including calling for objections to the certification of democratically counted votes. These actions emboldened the domestic terrorists who stormed the Capitol Building in an attempt to overturn the democratic elections. Such terrorists vandalized the Capitol and forced the recess of the Joint Session of Congress, as well as the evacuation of members of Congress and Vice President Mike Pence.&nbsp;</p>\n<p>Prior to the Joint Session, Hawley was photographed raising his fist in solidarity with these terrorists. Let that sink in. Josh Hawley is a supporter of terrorism.&nbsp;</p>\n<p>America and Missouri deserve more from their senators. Senators who push for insurrection and help orchestrate a coup do not deserve to remain in office. While Josh Hawley is certainly not the sole person to blame, his role in supporting, organizing, and encouraging domestic terrorists disqualifies him from representing Missourians and Americans.&nbsp;</p>\n<p>While I hope Hawley has enough shame to resign his office, his inability to distinguish good from evil to this point makes me doubt his emotional capacity. Therefore, while I call for his resignation, I also call on Majority Leader McConnell and Minority Leader Schumer to remove a cancer from the Senate's body.&nbsp;</p>\n<p>Add your name to this list: ResignHawley.com</p>", "image_url": "https://assets.change.org/photos/9/vd/iq/YdVdiqUKpcJUteD-800x450-noPad.jpg?1609971489"}, {"title": "Justice for Zara Kay", "description": "<p>Zara Kay, an Australian citizen and founder of Faithless Hijabi, was summoned to the Dar es-Salaam Oysterbay Police Station on 28 December 2020 and was held in police custody for 32 hours without an initial clear indication of charges.</p>\n<p>Zara is a well-known ex-Muslim and women’s rights activist.&nbsp;Faithless Hijabi,&nbsp;which she founded in 2018, supports women who have been ostracised or abused for leaving Islam. Whilst in police custody, Zara was asked about the work of her organisation and why she left Islam.</p>\n<p>Zara was bailed on 29 December 2020 and told to return to the police station on 31 December. Her passport was also confiscated. This morning, at the police station, Zara was given permission to return on Tuesday 5 January 2021 with her lawyer. This is because stress caused by her initial police custody exacerbated Zara’s underlying health condition.&nbsp; Late last night, Zara had to go to the local hospital where doctors reiterated her diagnosis of Generalised Anxiety Disorder.</p>\n<p>THE CHARGES AGAINST HER REMAIN AS FOLLOWS:</p>\n<p>1) Social media post deemed to be critical of the president of Tanzania&nbsp;(these light satirical posts were posted in May when Zara was in London, addressing the handling of Covid-19 in Tanzania)</p>\n<p>2) Not returning her Tanzanian passport after gaining Australian citizenship (she never returned her Tanzanian passport as she misplaced and never used it after gaining Australian citizenship)</p>\n<p>3) Using a SIM-card not registered in her name (this was registered in a family member’s name).&nbsp;Failure to register SIM-cards legislation has been used to persecute other high-profile cases.</p>\n<p>We believe these charges are politically motivated and initiated by those from the Khoja Shia Ithnasheri Jamaat who have threated Zara with death for leaving Islam and for her activism in support of ex-Muslims and women.</p>\n<p>CALL TO ACTION:</p>\n<p>This petition calls on the Tanzanian government to immediately drop all the charges against Zara Kay and allow her to leave the country. The constitution of Tanzania enshrines secularism as a state principle and recognises freedom of expression and of conscience. We also call on the Australian authorities to intervene and get Zara home to safety.</p>", "image_url": "https://assets.change.org/photos/6/zc/kx/wkZcKXeHzwGsJyq-800x450-noPad.jpg?1609804750"}, {"title": "Momma mel to get kenz a dog", "description": "<p>Kenz needs a dog!!! Lol</p>", "image_url": "https://assets.change.org/photos/0/ec/ib/QOEciBbFaPOMYuP-800x450-noPad.jpg?1610583766"}, {"title": "Save The Largest Hindu Temple from Destruction", "description": "<p>Save the God Whom Ayodhya Sri Rama Prayed To!&nbsp; SAVE Srirangam!</p>\n<p>We, the undersigned, are concerned citizens of the world, who are outraged by recent legal, moral, and cultural violations taking place at Sri Ranganatha Swamy Temple, Srirangam, Tiruchirapalli District, Tamil Nadu State.&nbsp; These concerns are specifically directed to and identify the following individuals as having key roles in the occurrence of these violations:</p>\n<p>P. Jayaraman<br>Joint Commissioner<br>Sri Ranganatha Swamy Temple HR&amp;CE</p>\n<p>Murali Bhattar<br>Chief Priest<br>Sri Ranganatha Swamy Temple</p>\n<p>Nandhakumar Bhattar<br>Priest<br>Sri Ranganatha Swamy Temple</p>\n<p>S Srinivasaraghavan Bhattar alias Sundar Bhattar<br>Priest<br>Sri Ranganatha Swamy Temple</p>\n<p>Muthaiah Sthapathy<br>HR&amp;CE appointed sculptor</p>\n<p>Venu Srinivasan<br>Srirangam Temple Trustee</p>\n<p>The noted violations include:</p>\n<p>1.&nbsp;&nbsp;&nbsp;&nbsp; Lurking trespass, criminal breach of trust under IPC and The Antiquities and Art Treasurers Act, 1972</p>\n<p>2.&nbsp;&nbsp;&nbsp;&nbsp; Changing Moolavar Vigraham during 2013 to 2015 Renovation and conducting the same without the formation of a Committee to oversee the activities.</p>\n<p>3.&nbsp;&nbsp;&nbsp;&nbsp; Removal of Salagramams from temple premises.</p>\n<p>4.&nbsp;&nbsp;&nbsp;&nbsp; Interference of Administrative department in the Agama rules of the temple.</p>\n<p>5.&nbsp;&nbsp;&nbsp;&nbsp; Significant reduction in the quantity of Prasadam offered to Lord Ranganatha and distributed to the people visiting the temple.</p>\n<p>6.&nbsp;&nbsp;&nbsp;&nbsp; Reducing the number of poojas and festivals that were established 1000 years ago by Sri Ramanuja and his followers.</p>\n<p>7.&nbsp;&nbsp;&nbsp;&nbsp; Discontinuing the age-old traditions of offering rituals of respect towards the Acharya Purusha families, who have been caring for the temple as volunteers for over 1000 years.</p>\n<p>8.&nbsp;&nbsp;&nbsp;&nbsp; Publicly beating and assaulting &nbsp;Mr. Rangarajan Narasimhan inside temple premises for questioning the lapses in tradition.</p>\n<p>9.&nbsp;&nbsp;&nbsp;&nbsp; Filing false cases against Acharya Purusha families, and threatening them with eviction.</p>\n<p>These moral and legal violations should be seen in light of UNESCO Reference 5894, filed by the Permanent Delegation of India to UNESCO in 2014, recognizing Sri Ranganatha Swamy Temple in Srirangam as a place of historical, cultural and religious significance, and including it under official consideration as a World Heritage Site. This document describes Srirangam as the largest Hindu temple on Earth, and extols it for its unique temple/town environment.&nbsp; This is seen by UNESCO as a harmonious blend of religious rituals, architectural wonder, historical record, and a vibrant social fabric.</p>\n<p>These are not isolated violations. Rather, they are a well orchestrated long term plan to destroy Hindu Sanatana Dharma, Temple traditions and the torch bearers of the 1000+ year old Sri Vaishnava Tradition. The violators are supported by powerful corporate giants having deep pockets. This has led to:</p>\n<p>1.&nbsp;&nbsp;&nbsp;&nbsp; Smuggling of Temple Statues</p>\n<p>2.&nbsp;&nbsp;&nbsp;&nbsp; Theft of Antiques</p>\n<p>3.&nbsp;&nbsp;&nbsp;&nbsp; Looting of rare gems and jewels</p>\n<p>4.&nbsp;&nbsp;&nbsp;&nbsp; Rampant burglary of temple treasures</p>\n<p>5.&nbsp;&nbsp;&nbsp;&nbsp; Systematic plundering of money offered to the temple</p>\n<p>6.&nbsp;&nbsp;&nbsp;&nbsp; Defiling Temple Traditions and Sanctity held sacrosanct over thousands of years</p>\n<p>7.&nbsp;&nbsp;&nbsp;&nbsp; Issuing life threats to protectors of the temple tradition and those questioning the violations.</p>\n<p>8.&nbsp;&nbsp;&nbsp;&nbsp; Filing of false defamation cases against Acharya Purusha families, who have hereditary rights to the temple, as established by Sri Ramanuja, called the Statue of Equality, 1000 years ago.</p>\n<p>9.&nbsp;&nbsp;&nbsp;&nbsp; Issuing eviction notices to the Acharya Purusha families, who have served the Temple as volunteers for generations.</p>\n<p>10.&nbsp; Allowing missionaries of other faiths to proselytize in the Temple premises.</p>\n<p>These violations done by the above individuals will be seen worldwide as an attempt to destroy this age-old cultural, religious, and architectural world heritage site.&nbsp; We, the undersigned call for the following:</p>\n<p>1.&nbsp;&nbsp;&nbsp;&nbsp; The immediate dismissal of the above-mentioned individuals for these heinous crimes and illegal activities.</p>\n<p>2.&nbsp;&nbsp;&nbsp;&nbsp; The formation of a Religious Committee consisting of the representatives of the Acharya Purusha families and the Jeeyars to restore and maintain the proper Agama traditions, prasadam services, and other related activities vital to the running of the temple’s age-old Sri Vaishnava traditions.</p>\n<p>3.&nbsp;&nbsp;&nbsp;&nbsp; The reduction of the Administrative Department HR&amp;CE involvement in temple activities to maintaining temple budget and accounting.</p>\n<p>The above must be made with immediate effect to avoid further corrective action.</p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/3/dy/hc/QpdYhCJpCxkbcQd-800x450-noPad.jpg?1610046323"}, {"title": "Stop Trump from drilling for oil and gas in the Arctic National Wildlife Refuge TODAY!", "description": "<p>Trump has rolled back regulations on the Endangered Species Act, and is now actively working to sell oil AND gas drilling rights in the Arctic National Wildlife Refuge...threatening the lives of our already dwindling populations of polar bears, caribou, wolves, whales and many many other species. These animals have well known migratory paths throughout the ANWR that will be destroyed and disrupted if drilling is allowed to occur there, not to mention how devastating the effects of drilling will be to their living environment.&nbsp;</p>\n<p>It is also a protected land of the indigenous Gwich'in tribes from the north who rely on these lands and the animals within them to live.</p>\n<p>The government claims this is a necessary evil to assure our economy and energy resources in america,however scientists and economic advisors have released papers saying that drilling here does not offer any economic or energy assurities to our country.</p>\n<p>The ANWR is the largest refuge of it's kind, we cannot allow it to be destroyed. Please help me fight this and protect our beautiful planet!</p>\n<p>Sign this petition please! And share it!</p>", "image_url": "https://assets.change.org/photos/0/su/bt/JBSubTmUYmaawUD-800x450-noPad.jpg?1605718003"}, {"title": "Justice for Athena", "description": "<p>&nbsp; &nbsp; &nbsp;My sister Athena Zepeda died of fentanyl poisoning on November 7, 2020. The person who gave her the fentanyl is still walking free. She is a known drug dealer selling multiple different kinds of pills and drugs to many kids on the streets of Riverside County. There have been no arrests made. We have come to the Riverside County Sheriff station in Jurupa Valley, Ca multiple times with evidence, eyewitnesses, and phone calls to no avail.&nbsp;<br>&nbsp; &nbsp; &nbsp;We create this petition in hopes to bring some light to Athenas Zepeda’s death. We want justice! We want the Riverside County sheriff station to interview the people that were involved, listen to the witnesses and just simply give us the time of day. We have not been able to get a hold of the responding officer, or anyone who seems to care for that matter.&nbsp;<br>&nbsp; &nbsp; &nbsp;Our family is broken beyond measure. We lost our beautiful bright young 20-year-old Athena due to fentanyl that this person is selling and their negligence to save a life. Please join us in petitioning for the Riverside County sheriff to look further into this case. Your signature would be a blessing to us! God bless!&nbsp;</p>", "image_url": "https://assets.change.org/photos/1/hh/vp/tKhhVpYMbRwCeDu-800x450-noPad.jpg?1609963573"}, {"title": "Matt Rosendale Should Resign", "description": "<p>Matt Rosendale swore an oath on January 3rd to uphold the Constitution. He is now one of its greatest threats. In the days leading up to the insurrection on January 6th, he vouched for the conspiracy theories and outright lies that fueled the violence in our nation’s Capital. When elected officials like him tell the American people that it's ok to doubt the legitimacy of our elections even after dozens of court cases and every state election official across the country says otherwise it should come as no surprise to him that some of those Americans commit violent acts.&nbsp;</p>\n<p>Both Representative Rosendale and Senator Daines intended to object to the lawfully certified votes submitted by the states. Unlike Senator Daines, who must also be held responsible, Rep. Rosendale still voted object to those sacred votes even after what he witnessed. He had seen with his own eyes what undermining our democracy leads to and decided to do it anyway.</p>\n<p>Representative Rosendale has made clear what he believes and who he supports. He has demonstrated an absolute contempt for our nation’s laws and for the lives of his own fellow representatives. He does not deserve to hold the seat to which he lays claim and should resign.</p>", "image_url": "https://assets.change.org/photos/7/tj/ty/jotjtYGQXWCqFTu-800x450-noPad.jpg?1610038529"}, {"title": "JUSTICE FOR JASMINE M. MELENDEZ!!", "description": "<p>WE DEMAND JUSTICE FOR JASMINE M. MELENDEZ!!&nbsp; WHOEVER DID THIS TO HER WILL BE BROUGHT TO JUSTICE!! NOT A DAY WILL GO BY THAT THE PEOPLE WILL NOT SEEK JUSTICE FOR THIS BABYGIRL!! THERE IS ALOT OF COVER UP GOING ON IN THIS CASE!</p>\n<p>&nbsp;</p>\n<p><a href=\"https://heavy.com/news/jasmine-melendez-dead/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://heavy.com/news/jasmine-melendez-dead/</a></p>\n<p>Jasmine Melendez was a 15-year-old girl from Midland,&nbsp;Texas, who died after she was beaten and sexually assaulted on Tuesday, October 20, her family said.&nbsp;NewsWest9&nbsp;reported that family members said Melendez was “sexually assaulted and beaten” on Tuesday and flown to a hospital in Dallas where she later died.</p>\n<p>CBS7 first&nbsp;reported&nbsp;that Melendez was found and had suffered a major brain injury and had fluid in her brain, according to family members. The outlet also reported that the teenager suffered a heart attack and died in the hospital. On Friday, the Midland Police Department issued a statement, as&nbsp;shared&nbsp;by Shane Battis of CBS7, that “detectives have found no indication of foul play or criminal conduct” but that the investigation is ongoing.</p>\n<p>The Midland authorities issued a statement on Thursday to&nbsp;CBS7, reads: “The Midland Fire Department responded to a call for medical assistance on October 20, 2020 and due to the nature of the call, involving a juvenile, asked the Midland Police Department for assistance. The Midland Police Department responded and an investigation is ongoing.”</p>\n<p>A spokesperson for the Midland Police Department also told NewsWest9 that, “To the extent that there may be a criminal investigation involving sexual assault of a child, the City is unable to comment or confirm any information.” Heavy also reached out to the MPD for more information but did not immediately hear back.The Midland Independent School District spoke about the situation during a&nbsp;Thursday press conference&nbsp;but provided no additional details about Melendez’s death. About 37 minutes into the press conference, a question was asked about a student “allegedly assaulted near (Midland High School), she was sent to the (Dallas-Fort Worth) metroplex and died.”Dr. Katie Atkins, the district’s chief of staff, answered: “I don’t have further information on that unfortunate situation, absolutely tragic situation, our hearts and our sympathies are certainly with that family. I don’t have further information to share with this group at this time.”</p>\n<p>Melendez was passionate about softball and well known around the Midland United Girls Softball (MUGS) complex, where she spent a lot of time, NewsWest9&nbsp;reported. Those who knew her described her to the outlet as “sweet and hardworking.” Jennifer Evans, one of her former softball coaches, said she was a star athlete and an even better person:</p>\n<p>She was really compassionate, she would just lift everybody you know what I mean, she was encouraging. People called her feet because she was crazy fast. Even the ones who needed help or guidance or anything she would help them out she was a great friend. Her smile lit it up the room, it lit up the field.<br>The outlet reported that the games on Thursday night all began with a moment of silence for Melendez, and the players wrote her number, 12, on their cheeks. A video&nbsp;posted to Twitter&nbsp;showed the emotional moment that her teammates carried her jersey around the bases:</p>\n<p>Rick Maddox with the MUGS Softball Organization told NewsWest9, “She deserves the honor of what we’re doing tonight and in respects of everybody because she earned that but it’s just I hate that we have to do it you know for that reason that she’s gone.”</p>\n<p><br>Many Midland Groups Are Organizing Fundraisers to Support Melendez’s Family<br>The Midland High School’s softball team announced on&nbsp;Facebook&nbsp;that they would be setting up two accounts, one to support the family with medical and funeral expenses and another to create a “scholarship account that will honor the hard work and dedication Jasmine has given to the program.”</p>\n<p>The family also set up a&nbsp;GoFundMe&nbsp;page to help raise money for Melendez’s mother for “medical bills, funeral expenses, and any others costs endured.”Shane Battis with CBS7 also posted on&nbsp;Facebook&nbsp;about a barbeque and car show on Sunday in Midland that will help raise funeral funds for the family.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/9/if/of/mFiFoFdQLjJAkED-800x450-noPad.jpg?1610337625"}, {"title": "Justice for Jace Leslie", "description": "<p>MY 21 MONTH OLD SON JACE LESLIE DIED ON SEPTEMBER 11, 2020 AFTER BEING LEFT IN A HOT CAR FOR MORE THAN 7 HOURS BY HIS CAREGIVER. PEOPLE ARE CHARGED FOR LEAVING ANIMALS IN VEHICLES. MY SON WAS A HUMAN BEING. HE DIDN'T DESERVE THIS CRUEL DEATH. THAT DAY TEMPERATURES REACHED 105. LET THAT SET IN... HE WAS LEFT IN HER CAR WHILE SHE TAUGHT OTHER CHILDREN IN A/C. THERE IS NO REASON FOR LEAVING A HIM IN THE CAR, AND NOT DROPPING HIM TO SCHOOL WHICH &nbsp;WAS THE ROUTINE. THE STATES ATTORNEY OFFICE HAS DROPPED ALL CHARGES,THIS IS HAPPENING DUE TO LACK OF ACCOUNTABILITY AND INCONSISTENCY. NEGLECT IS NEGLECT. I AM DESPERATE FOR HELP TO REOPEN HIS CASE. I AM SEEKING JUSTICE AND ACCOUNTABILITY. MY SON “JACE” DESERVES JUSTICE. PLEASE HELP ME FIGHT INJUSTICE BY FIGHTING FOR JUSTICE. SIGN THIS PETITION TO REOPEN THE CASE!<br><br>#JusticeForJaceLeslie <br><br></p>", "image_url": "https://assets.change.org/photos/4/lx/xx/PJlXXxcPBqlNFIb-800x450-noPad.jpg?1609818695"}, {"title": "DAYS WITH NO RESCUE FOR STARVING DYING WHALE CAUGHT IN FISHING NETS IN JAPAN", "description": "<p>A minke whale has been trapped in fishing nets in Japan for days without rescue. &nbsp;The whale is stressed, suffering, starving and near death!</p>\n<p>The whale faces CERTAIN DEATH SOON if a rescue is not undertaken immediately!</p>\n<p>The world needs to rally and take action now--not only for this whale, but for thousands of other marine animals, including dolphins, that are repeatedly trapped in these fishing nets.</p>\n<p>This is nothing less than torture and coldblooded murder of innocent and defenseless marine life.</p>\n<p>Please contact the Japan Fishing Agency International Affairs Division NOW before it is too late! &nbsp;</p>\n<p>Also, please spread the word to marine rescue organizations who can help and begin this urgent rescue!</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/3/sf/ou/lKsFOuSxlFPOIsa-800x450-noPad.jpg?1609870597"}, {"title": "BringZekeHome", "description": "<p>Please take the time to read my brothers post below and sign this petition. My brother fundraised the money to purchase Zeke for the Corcoran Police Department. After 3 years together my brother has made the decision to retire due to his mental illness. It is heartbreaking to me that not only my brother is losing his partner in crime, but Zeke is losing his world. I see Zeke with Cody, and it is a bond that should not be broken.<strong><br></strong></p>\n<p><strong>Codys post-<br></strong>Thank you to the Corcoran Police Department. After 4.5 years of service, and 3 as K9, as well as previous service with Stearns County, I medically retired due to PTSD which caused suicidal ideation and attempts. Prior to my employment there was not a K9 unit, but I was able to fully fundraise, and implement a K9 unit. Thank you to the Shoulak Family foundation, the Northwest Area Jaycees, the Corcoran Lions, McDonough K9 and all others that have supported us.</p>\n<p>One of the conditions of my retirement recommended by my therapist was to retire my K9 partner, Zeke, to live out his time with me as a service animal. Understand the bond between man and dog after 3 years of being together 24/7 and going into the worst of the worst side by side.</p>\n<p>As if the job didn't take enough from me, the Chief called today and said they will be taking Zeke from me and reassigning him. Mind you, I was done December 17th and have had him since with no communication from the city.</p>\n<p>Thanks for the partnership my eekey boy. Be safe buddy. I love you.</p>", "image_url": "https://assets.change.org/photos/2/le/tg/tVLETGZzAkQTcvh-800x450-noPad.jpg?1610759786"}, {"title": "Save Joe the Pigeon", "description": "<p>After flying over the Pacific Ocean from Oregon to Australia, Joe the Pigeon was found by the Australian Quarantine and Inspection Services to be a bio risk to their country’s ecosystem because pigeons are not native to Australia. Now they plan to euthanize him because he chose to land in their country. Please sign this petition to urge the department and Australian government to not kill Joe and to return him safely back to the United States. There is no need to kill an innocent animal for doing what he naturally does. I know, through all of our individual power, we can ensure Joe the Pigeon remains alive to see his home in America once again.&nbsp;</p>", "image_url": "https://assets.change.org/photos/2/jb/zr/bJJbzryURrvtJBu-800x450-noPad.jpg?1610639939"}, {"title": "Military members and veterans who participated in Capitol assault should lose all benefits", "description": "<p>Active duty, Guard, and Reserve servicemembers as well as military veterans who are found to have participated in illegal activities involved in the assault on the Capitol Building on 6 January 2021 should lose all VA benefits regardless of discharge type and length of service. &nbsp;By participating in such treasonous activity and becoming the domestic enemy they swore to protect and defend the Constitution from, they have in effect become enemies of the state and thus should not receive ANY VA benefits, to include healthcare, education, financial assistance, burial with military honors, among others.&nbsp;<br><br></p>\n<p>Their actions are a stain on this great country and an affront to those who have served and continue to serve honorably. &nbsp;In addition to being held accountable through legal proceedings, they must also face consequences such as losing their taxpayer-funded VA benefits.&nbsp;</p>", "image_url": "https://assets.change.org/photos/7/kl/xv/TgKLXvbaAOqMWbp-800x450-noPad.jpg?1610221215"}, {"title": "Mental Health Stability Amongst Student Body", "description": "<p>As you know, the world right now is in chaos and in ruin. The recent events include the whole COVID-19 Pandemic, Capitol riots, the bombings in many states, and more. However, In the Northbrook Community, there are more pressing matters. At Glenbrook North High School, in the last 4 years, there have been 2 suicides. Last year there were bag searches done by teachers in response to bomb threats within the school. Our district has done nothing to change what is going on.</p>\n<p>They are telling us to use the recourses that we have always had to try and make it seem better. What they don't realize is that it won't do much. It's not fair for us as students to have to go through any of this at this age. We have finals coming very soon and our school decided to change anything about it. With the recent events, no one is able to focus on finals, let alone focus on classes. So many kids are in a really bad place right now mentally and emotionally, and that changes should be made in order to ease the minds and emotions of the student body.&nbsp;</p>\n<p>The teachers try and make it seem less stressful by telling us they are always there. But half if you email a teacher for help they will either not help at all, tell you to see a counselor, or report it to the deans. With everything going on we could really use the support of others and some sort of relief to show our district that this is a serious matter that shouldn't be taken as a normal day with all the same help we would normally get.</p>", "image_url": "https://assets.change.org/photos/0/wg/sq/GYWGsqlbpAFarKb-800x450-noPad.jpg?1610155915"}, {"title": "Rep. Scott Perry (R-PA) must resign", "description": "<p>Scott Perry is the congressperson representing the 10th district of Pennsylvania.&nbsp;On Wednesday, January 6th, <a href=\"https://www.buzzfeednews.com/article/addybaird/republicans-object-biden-win-electoral-college-count\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Perry violated his constitutional duty and objected to the ratification</a> of the duly certified electoral votes of the Commonwealth of Pennsylvania.</p>\n<p>By the act of voting to object to the legitimate election outcome of our commonwealth, Rep. Perry has disgraced himself.&nbsp; A member of the U.S. Congress must have an unimpeachable reputation for supporting representative government, democracy, and the rule of law.&nbsp; Anything less than that is an affront to each and every citizen that member of Congress represents.</p>\n<p>The terror committed at the Capitol on January 6th was the culmination of months' worth of misinformation propagated by the president and many of his supporters in Congress and other elected offices.&nbsp; Scott Perry is one of the perpetrators of this farce.&nbsp; We acknowledge and recognize the right of Rep. Perry to speak freely about their personal opinions; we condemn Perry's use of congressional authority in a bid to overturn a legitimate election - the very same votes that brought him into office.</p>\n<p>We, the people of the 10th Congressional District of Pennsylvania, demand that Scott Perry resign as our congressperson.</p>", "image_url": "https://assets.change.org/photos/6/hz/oe/JRhZOeovvWWaCXY-800x450-noPad.jpg?1610031727"}, {"title": "Down with Kentucky Pound Seizure", "description": "<p>Pound seizure is the legalized sale or seizure of shelter animals for the purpose of dissection, vivisection, or experimentation in research or education. Though seventeen states and the District of Columbia have banned pound seizure, Kentucky still allows municipalities and individual shelters to decide whether or not they will release animals to labs.&nbsp;</p>\n<p>Aside from subjecting animals to unspeakably inhumane conditions, the practice of pound seizure challenges the integrity of shelters and loses the trust of those surrendering animals. Rather than risk their pet being surrendered to a research facility, many people abandon their pets, leading those animals to face starvation and other threats to their survival.&nbsp;</p>\n<p>In addition to promoting increased rates of animal abandonment, pound seizure decreases shelters' commitment to securing adoptions for the animals in their care. With a market already available for their animals, shelters are less likely to seek out adopters, especially when an animal meets the specific requirements for a particular lab or institution.</p>\n<p>In order to abolish pound seizure in the state of Kentucky, the practice must be outlawed and not left to the discretion of municipalities. Shelter animals are deserving of the same dignity one would pay to a favorite four-legged companion. No shelter animal is safe while pound seizure is in effect.&nbsp;&nbsp;</p>", "image_url": "https://assets.change.org/photos/9/eu/lq/hUEulqyzCJwlJnH-800x450-noPad.jpg?1603748878"}, {"title": "Allow males to wear nail polish", "description": "<p>Hello, my name is Trevor Wilkinson and I am a senior at Clyde High School. Today, &nbsp;I got ISS (in school suspension) for having my nails painted. I was told that I will continue to get ISS until I take them off. It’s a complete double standard because girls are allowed to paint and get their nails done. Not only that, but freedom of expression is validation enough that the dress code and policy is not okay. I am a gay male and I’m beyond proud. This is unjust and not okay. Help me show that it is okay to express yourself and that the identity that society wants to normalize is not okay. I am a human. I am valid. I should not get in trouble for having my nails done. Sign and share this so people like me don’t have to ever deal with this again. It’s time for a change and that time is now. Thank you;)&nbsp;</p>", "image_url": "https://assets.change.org/photos/6/ak/jc/mWAKjcGDpghfkeL-800x450-noPad.jpg?1606783497"}, {"title": "Say NO to PETLAND in Memphis!", "description": "<p>Petland cannot be allowed to set up shop in Memphis.&nbsp; This community does not need another tragic tale of cruelty and death of animals entrusted to the care of humans.&nbsp;</p>\n<p>Petland is a financial machine proven to have locations that obtained their animals from \"puppy mills\", has been investigated by The Humane Society of the United States with horrible proof of mishandled animals and illness (including death), has terrible ratings and reviews from buyers (and staff!) that have had animals die or need to be euthanized because of undisclosed medical issues.&nbsp; The reviews and videos are heartbreaking.&nbsp; &nbsp;<br><br>It's not just one location, one instance... it's multiple locations over decades.&nbsp; Dogs thrown away in bags (yes, there are photos).&nbsp; Diseased animals in the care of and sold to unsuspecting humans (their own pets and themselves in harm's way as a result!).&nbsp; Learn more about HSUS's investigations and actions to stop Petland<br><a href=\"https://www.humanesociety.org/petland\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://www.humanesociety.org/petland</a></p>\n<p>Memphis has come a long way to improve it's city animal services but we still face the continuance of strays, overpopulation and animals dumped because owners cannot care for them.&nbsp; Why do we need a Petland when we have plenty of companion animals ready and waiting for a home?&nbsp;&nbsp;<br><br>The last thing our community needs is a Petland - unless Petland wants to work directly with local shelters and rescue groups, rather than trying to sell pets for profit.&nbsp; &nbsp;<br><br>Please sign this campaign to let Petland know they are not welcome in Memphis and let TSCG (the property management company brokering the retail location) know that you will not be shopping at any of the retail locations in The Commons at Wolfchase if Petland is allowed to move in.&nbsp;<br><br>Please also call local retailers in The Commons (Giacosa Pl Memphis, TN 38133) and ask THEM to get involved - tell them you won't frequent their location with Petland in their shopping center.&nbsp; &nbsp;Local retailers include:&nbsp; TJ Maxx, Academy Sports, The Home Depot, Big Lots, Burlington, Ollie's Outlet, Michaels, Old Navy, etc.&nbsp;<br><br>Call TSCG and implore them (respectfully) to decline this retailer in our community - tell them you won't shop at The Commons also.&nbsp; Let them know they will lose money when other businesses start to close because they welcomed Petland into our community.&nbsp;&nbsp;</p>\n<p>WE are their voice - only we can stop this.&nbsp;<br><br>Photo by the HSUS<br><br>TSCG &amp; The Commons Information:<br><a href=\"https://www.theshoppingcentergroup.com/property-search/?propertyId=269507-lease&amp;fbclid=IwAR28yA3hYUbw1uFAvMnYPDds2cMGhzYW2kOi6f9WpFvYVihj8qoCBKOb5Wc\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://www.theshoppingcentergroup.com/property-search/?propertyId=269507-lease&amp;fbclid=IwAR28yA3hYUbw1uFAvMnYPDds2cMGhzYW2kOi6f9WpFvYVihj8qoCBKOb5Wc</a></p>", "image_url": "https://assets.change.org/photos/5/gm/xe/wtgMxeYQSMQTxyc-800x450-noPad.jpg?1609632786"}, {"title": "Rename of Donald J. Trump Park to Sojourner Truth Park", "description": "<p>Names have meaning and the names given to public property have significance in how we choose to reflect the character and values of who we are as a nation and people.&nbsp; This is a proposition to change the name of Donald J. Trump Park to Sojourner Truth Park.&nbsp; The 465 acre parcel of land is located on the eastern bounds of the Taconic State Parkway spanning Westchester and Putnam Counties.&nbsp;</p>\n<p>There have been three previous attempts to rename the 465 acre parcel currently bearing the name Donald J. Trump Park.&nbsp; Public record will show that Trump and his associated development company paid $2 million for this property. After being unable to develop the property, the land was donated to the State of New York which he and his firm used as a tax write-off.&nbsp; This was not a charitable gift derived out of generosity but an equitable exchange of real property for a financial incentive.</p>\n<p><br>Several previous proposed names have all been admirable choices but perhaps have not met the benchmark through which most public lands have been rededicated in our State, to honor individuals rather than perhaps individuals who have donated land. The naming of a park should be that of a historic New Yorker who has made an outstanding contribution to the history and development of our state and one who evokes the values of patriotism, inclusiveness and equity under the law.&nbsp; There are few individuals who embodied the spirit and diversity of New York like Sojourner Truth. It seems only fitting that a park stripped of the name of a man who incited insurrection should be replaced with that of a woman who fought against and helped defeat insurrectionists.&nbsp;</p>\n<p><br>Sojourner Truth was born into slavery as Isabella Baumfree near Kingston, NY in 1797.&nbsp; She was sold at least twice during her early life and was not freed until mandated under State Law in 1827.&nbsp; Truth successfully sued for the return and freedom of her son from the State of Alabama in 1828.&nbsp; As a free person she became active both within her church as well as the abolition and suffrage movements.&nbsp; She gained national notoriety for her speech “Ain’t I a Woman” and would actively participate in the causes of emancipation, enfranchisement and equal protection under the law.&nbsp; Her ardent activism to help her neighbors and fellow Americans was tirelessly carried out all the while supporting and raising a family on her own.&nbsp; Truth passed away at Battle Creek, Michigan in 1883.&nbsp; Shortly after her death Frederick Douglass said she was “Venerable for age, distinguished for insight into human nature, remarkable for independence and courageous self-assertion, devoted to the welfare of her race, she has been for the last forty years an object of respect and admiration to social reformers everywhere.\"</p>", "image_url": "https://assets.change.org/photos/7/eu/fv/EbeufVXNUSCzioD-800x450-noPad.jpg?1610420884"}, {"title": "Make transporting dogs unsecured on truck beds illegal in the state of Utah", "description": "<p>On the afternoon of July 16th myself, husband, and 4 year old daughter were driving north on 1-15 in Ogden, Utah when we witnessed my greatest fear, a dog falling from the bed of a pick up truck going roughly 80 MPH. This dog was okay, but very scared and was lucky to be alive. This act is something that is very common in Utah and puts our beloved pets and family members at a high risk of injury or death. Myself and the Humane Society of Utah are working diligently to make this illegal in the state of Utah. Now, this is where you come in. Every signature on this petition helps show the state that we are serious about this and want to push forward with making this a law. Thank you for your support!</p>", "image_url": "https://assets.change.org/photos/8/ig/nr/bxigNraCksnhofF-800x450-noPad.jpg?1602184173"}, {"title": "Stop the sale of the ANWR for oil drilling", "description": "<p>Drilling in the Arctic Refuge would be disastrous for wildlife and the Indigenous people who live there. Every single one of the 32 tracts that the Bureau of Land Management is considering selling off for drilling on the Arctic Refuge coastal plain include sensitive resources that would be threatened by drilling. It is well documented that and gas developments and infrastructure disrupt wildlife and natural resources, both of which are essential to the Indigenous people living on the coastal plain.</p>\n<p>The Porcupine Caribou herd is especially in danger. The entire coastal plain is critical for the caribou to raise their young, and caribou mothers are particularly sensitive to disruptions in their habitats. The Gwich'in people have a deep cultural and spiritual connection with the caribou, and depend on the Porcupine Caribou herd for about 80% of their diet. Without any habitat for the caribou their way of life will be threatened. Continuing with the plan to drill on the coastline would ultimately threaten the lives of the Gwich'in people, who have lived and depended on the coastal plain for generations. Human lives are not worth sacrificing for corporate greed.&nbsp;</p>\n<p>Aside from the clear violations of human rights, destroying the Alaskan environment for oil would also be extremely harmful for polar bears. Almost all of the coastal plain is designated as critical denning habitat for polar bears under the Endangered Species Act. Keeping this area free from disturbances is essential for the survival of newborn cubs. The U.S. Fish and Wildlife Service has admitted that leasing in areas where polar bears den will negatively effect polar bears.</p>\n<p>We cannot allow the Alaskan environment to be destroyed.&nbsp;</p>", "image_url": "https://assets.change.org/photos/5/cj/nt/qzcjNtrIMWobsjf-800x450-noPad.jpg?1607299768"}, {"title": "EXPEL SENATOR RAFAEL TED CRUZ FROM THE SENATE!!!", "description": "<p>We the People Petition Senate Leadership to immediately Expel Senator Rafael \"Ted\" Cruz as well as other Senators who have show time and time again that they do Not believe in Democracy or the Constitution of the United States instead of Being loyal to the Constitution and Principles of U.S. Democracy they are loyal to a wanna be Dictator Tyrant. Everything our founding fathers were against. Ted Cruz has shown time and time again that he does&nbsp;<strong>Not</strong> Value the Constitution or Democracy for that matter.as one of Rafael \"Ted\" Cruz's Constituents I have watched for years as Ted Cruz has used Lies and Misleading statements to advance his political career. Finally those Lies have come to a head Our Nation has been embarrassed, our Election Officials have been threatened and four people including a Police Officer have died as a result of the actions and rhetoric of Ted Cruz, Donald Trump and over 100 other members of Congress. Ted Cruz said in a statement that he was speaking to give a voice to the people who had doubts about the Election. Doubts that He, Donald Trump and other Republicans helped sow. with No validity what So ever! I now ask that some one speak for us the people who question whether Ted Cruz, Donald Trump and Other Not all Republicans. helped instigate a coup and insurrection we deserve to have our voices heard as well. As concerned Citizens we ask for the Senate to Expel Rafael Ted Cruz for his Treasonous actions that threaten the stability and the Democracy of the United States of America. An ask that he be prosecuted under the appropriate laws for sedition! So that it may serve as an example to those who threaten Democracy that all will be held accountable&nbsp;<strong>please sign my other related petition<a href=\"https://www.change.org/restoreintegrityinvoting\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Help stop misinformed voting</a></strong></p>", "image_url": "https://assets.change.org/photos/1/ai/rb/KBaiRbDnjFmyFFH-800x450-noPad.jpg?1609655193"}, {"title": "Add New Hampshire Teachers to Phase 1B", "description": "<p>New Hampshire is one of only two states that has chosen to not vaccinate teachers in phase 1B, as recommended by the CDC. Let’s share our concern with our Governor, Chris Sununu, our students families and the task force in charge of distribution!&nbsp;</p>", "image_url": "https://assets.change.org/photos/9/iv/ji/qVivJiAVTIDeHUm-800x450-noPad.jpg?1610677454"}, {"title": "Strip section 230 protections from Big Tech!", "description": "<p>Big tech censorship is out of control! They’re stifling free speech to those they don’t agree with. This is not communist China! Strip section 230 protections from big tech and edit the following: They should not be held liable for what their users post, but they should be held liable for their censorship! They must be held responsible for their tyranny on their platforms.</p>\n<p>Big tech should not have bullet proof immunity that protects them from all misdeeds! Too much power causes too much abuse of said power!&nbsp;<br><br>Please sign and share my petition if you have the time. Big Tech are the only companies in America that have complete immunity from being sued for their actions, and it’s only because Congress gave them those protections! It’s time for Congress to repeal Section 230 and put Big Tech on the same legal footing as every other company in the US! Censorship in the US should not be tolerated! Big tech should not be held liable for what their users post, but still be held liable for their bias censorship.&nbsp;<a href=\"http://chng.it/PwrZM6Xh\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">http://chng.it/PwrZM6Xh</a></p>\n<p>“Big Tech are the only companies in America that virtually have absolute immunity from being sued for their actions, and it’s only because Congress gave them that protection,”Senator Lindsey Graham said.</p>\n<p>“It is now time for Congress to repeal Section 230 and put Big Tech on the same legal footing as every other company in America. Legal accountability.”</p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/3/me/wx/LCMEwXmdGKBOZUo-800x450-noPad.jpg?1610158002"}, {"title": "#RemovePaulGosar - Protect our Constitution.", "description": "<p>#RemovePaulGosar from Congress. By refusing to recognize the results of the certified election and supporting allegations without evidence Congressman Paul Gosar encouraged the terrorists and seditionists disrupting our constitutional process.</p>\n<p>Furthermore Paul Gosar encouraged the rally that stormed the capital building and continues to agitate against the norms of our democratic republic.</p>\n<p>Through these actions Congressman Paul Gosar has shown that he is not fit to protect the constitution and needs removed from his congressional role.</p>\n<p>As current constituents of Paul Gosar in Yavapai County we are asking for petition signatures from residents of Arizona CD 4, Arizonans, and Americans to call on current members of Congress to refuse to seat Paul Gosar.</p>\n<p>If no consequence is given for seditious acts they will continue and the fabric of our country will unravel. We will submit these signatures to the Arizona Congressional Delegation and urge our local elected officials in his congressional district to reject the dangerous political insurrection fostered by Paul Gosar. The most effective way to remove his toxic influence from Congress is to not allow him to be seated in the 117th Congress.</p>\n<p>The Yavapai County Democratic Party</p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/3/db/ep/KvDbEPBdAwSLgkF-800x450-noPad.jpg?1610049374"}, {"title": "Show WDFW you don't support current restrictions involving coastal steelhead.", "description": "<p>IF YOU ARE IN SUPPORT OF WDFW NO LONGER USING THE NO FISHING FROM A FLOATING DEVICE AS A CONSERVATION TOOL PLEASE SIGN BELOW</p>\n<p>BE AWARE: &nbsp;ALL DONATIONS GO TO CHANGE.ORG, NOT THE STEELHEAD WORKGROUP!</p>\n<p>&nbsp;</p>\n<p>Thanks for taking the time to read this petition.</p>\n<p>On January 12th 2021, a panel known as the \"Steelhead work group\" presented arguments to the Washington Legislature pertaining to the ongoing management decisions by the Washington Department of Fish and Wildlife for Washington coast steelhead fishing.&nbsp; Presenters from both for and against the \"no fishing from floating devices\", gave testimonies where it became clear that the WDFW decision making process focused on a small group of individuals siding with the state agreeing with the closure.&nbsp; The WDFW claimed that they received&nbsp;overwhelming support for the restrictions but we believe that the WDFW should have taken into account the vast MAJORITY of anglers that do not side with that statement and this petition is a great tool to show just that. &nbsp;</p>\n<p>This petition is by no means brushing off the need for conservation measures to protect wild steelhead. &nbsp;In fact, we are passionate about wild steelhead.<br><br>While escapement forecasts in some regions are underperforming, there are many basins that don't warrant the need for these restrictions and are forecasted to be well above escapement.&nbsp; Within a couple of those, there are also hatchery runs where anglers will need to have access to catch and capitalize on bringing a fish home. &nbsp;This access come from the form of \"Fishing from a floating device.\"</p>\n<p>The WDFW has set a dangerous precedent with these current restrictions.&nbsp; By signing this petition you are agreeing that :</p>\n<p><br>---The WDFW needs to take a harder look at equitable solutions to steelhead management for all user groups.<br>---The anglers of WA State discourage these \"blanket\" approaches to management and restrictions<br>---Without river specific studies regarding the amount of current boat fishing pressure and available bank access, no quantitative analysis can be accurately used as a reduction to steelhead encounters<br>---The anglers of WA ask that user groups like disabled, elderly, &nbsp;and young anglers not be excluded from participation<br>---The anglers of WA disagree with the restriction of \"no fishing from a floating device\" as a management tool as it picks winners and losers for fishing access</p>\n<p><br>This is one small step on the long journey of calling for our state managers to get our steelhead runs in check.&nbsp; If the restrictions hold and user groups are left out, we run the risk of losing the steelhead's&nbsp;largest&nbsp;advocates for the future, the sport anglers of the Pacific North West.</p>\n<p>&nbsp;</p>", "image_url": "https://assets.change.org/photos/6/uk/fw/JRUKfwYhPfemVyT-800x450-noPad.jpg?1610508165"}, {"title": "Allow Paul Marinsky To Keep Tootsie", "description": "<p>Paul Marinsky lost his wife, Brittani, to cancer on August 30th, 2020 and now Starfleet Service Dogs wants to take away his dog as well. After seemingly and deceitfully hinting that they were willing to work with Mr. Marinsky, they sent someone to take the dog after a vet appointment. This dog was never just a tool but a beloved family member and companion to the family and is arguably continuing to fill her service dog role in the wake of the family's grief. This petition will be sent to Starfleet Service Dog Inc. to make them aware of the public's dissatisfaction with their ethics and gray area policies.</p>\n<p><a href=\"https://www.cbs42.com/entertainment/after-losing-wife-to-cancer-kansas-man-goes-to-court-to-keep-her-beloved-service-dog/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://www.cbs42.com/entertainment/after-losing-wife-to-cancer-kansas-man-goes-to-court-to-keep-her-beloved-service-dog/</a></p>\n<p>If you would like to help with legal fees then there is also a gofundme.&nbsp;</p>\n<p><a href=\"https://www.gofundme.com/f/legal-fees-for-keeping-tootsie?utm_source=customer&amp;utm_medium=copy_link&amp;utm_campaign=p_cf+share-flow-1\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://www.gofundme.com/f/legal-fees-for-keeping-tootsie?utm_source=customer&amp;utm_medium=copy_link&amp;utm_campaign=p_cf+share-flow-1</a></p>", "image_url": "https://assets.change.org/photos/9/yy/yg/fMYyYGCwdukCDav-800x450-noPad.jpg?1610589168"}, {"title": "Amend the Constitution to add term limits for Senators, Representatives and Governors.", "description": "<p>98% of incumbents are re-elected, and as a result, Congressional elections are stagnant. Our leaders are supposed to represent We The People; However, the system has proven that once they are elected, they have little chance of being removed from office. This truth makes our leaders more akin to lords and tyrants than political servants of We The People. The State and Federal governments have become so far removed from The People they represent that they no longer have a sense of accountability for their actions that continue to harm We The People. <strong>Thus, We The People need to reinvigorate accountability into our government by forcing our leaders to adopt self restraint upon themselves by introducing a new amendment that will force term limits on our Senators and Congressmen who have become career politicians, and yes, We The People need to fix America.</strong></p>", "image_url": "https://assets.change.org/photos/7/hn/by/MFhNBYPUrOwlAYX-800x450-noPad.jpg?1604881565"}, {"title": "Justice for Jacob MacDuff", "description": "<p>Jacob MacDuff was murdered by a Tigard Police Officer on January 6th, 2021, outside of his apartment complex in Tigard, Oregon.&nbsp;</p>\n<p>Jacob had been struggling with mental illnesses for quite some time, and more recently, his mental health had deteriorated rapidly. He felt misunderstood, as if no one could understand his struggles.</p>\n<p>From our most recent sources, Jacob’s roommate sensed his decline, and reached out to the Tigard police department every single day, for almost a week in hopes they could and would do something to help him. However, they told her they could not do anything to help unless Jacob committed a crime.&nbsp;</p>\n<p>Jacob’s roommate called every day, for five days with no assistance. On the sixth day, the police were called with allegations of domestic abuse (or it could have been a disturbance) - his roommate did so because remember, they would not come unless Jacob committed a crime. The real reason they were called was for the same reason they were called every day for a week - a mental health crisis. They knew this, the dispatchers told them this.&nbsp;</p>\n<p>When they arrived Jacob was in his car outside his complex, suffering from a mental health crisis alone. The police approached Jacob’s vehicle and tried to detain him. Jacob did not want to be detained - remember, he is in the midst of a mental health crisis. A struggle for detainment between the police and Jacob ensued, which ended in a police officer shooting Jacob 10+ times, unloading a full clip, killing him. He was only 26 years old, with so much life ahead of him. Police officers have tasers, batons, rubber bullets and mace. What on earth would constitute using a gun in this situation? Jacob loved and cared for everyone, and tried his best to help others even when he himself was struggling so deeply on the inside.&nbsp;</p>\n<p>The police reports say he was in possession of a “knife.” But this knife was a pocket knife with a 1.5 inch blade that he would carry on his keychain. This small pocket knife was by law not a deadly weapon, and in no way shape or form did Jacob pose a threat.</p>\n<p>After news of his murder spread, protests and riots ensued within Tigard, Oregon, with hundreds protesting such a gross injustice. The news of Jacob’s murder has been localized, but we are here to spread and disseminate it.</p>\n<p>A mental health crisis cannot equal a death sentence. Police departments and their forced MUST be retrained and there must be protocols in place to assist those who are obviously in need of mental health assistance. Many countries and states such as Colorado have a mental health force that arrives at a mental crisis scene prior to law enforcement, to de-escalate the situation as opposed to what the police did to Jacob. This needs to be instated in every state and county.</p>\n<p>We are not asking for condolences or prayers, we are asking for help - help in getting justice for Jacob in a system that whole heartedly protects the police. If you have any extra funds, please consider donating to his twin sister’s go fund me: <a href=\"https://www.gofundme.com/f/28xlfpc0hc\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://www.gofundme.com/f/28xlfpc0hc</a> You can also sign this petition to help get justice for Jacob, or spread his story if you get the chance. If you have some extra time and feel like being an activist, you could email or call Tigard, Oregon officials regarding Jacob.</p>\n<p>Our system needs change, and people need to be held accountable, no matter the occupational title they hold.&nbsp;</p>\n<p>We are trying to reach the attention of Oregon governor Kate Brown to ensure that justice be brought upon Jacob by having the officer(s) who are responsible for his murder fired and charges immediately filed.</p>", "image_url": "https://assets.change.org/photos/4/ea/cv/AmeAcVlFdzzcgED-800x450-noPad.jpg?1610322846"}, {"title": "Expel Cruz and Hawley from the U​.​S. Senate", "description": "<p><strong>On January 6th, 2021, a violent mob attacked a process and a structure sacred to our democracy: certification of the electoral college results at the U.S. Capitol.</strong></p>\n<p>Between \"stop the steal\" rallies, baseless lawsuits, even Rudy Giuliani's suggestion of \"trials by combat,\" members of Republican leadership pushed conspiracy theories and incited the violence of these self-proclaimed \"patriots.\"</p>\n<p>In the days since, the rioters have learned that their actions have consequences –the internet is identifying them from their proud-faced photos, airlines are adding them to No-Fly lists, and the FBI is picking them up.</p>\n<p>As for the GOP?&nbsp;<em>Not so much.</em></p>\n<p><strong>But a steadily growing number of Senators are calling on their colleagues Ted Cruz (R-Texas) and Josh Hawley (R-Mo.) to resign – or be expelled – for leading the charge to object to Biden electors and refusing to take accountability or adequately condemn the insurrection.</strong></p>\n<p>We agree and believe that Sens. Cruz and Hawley have violated their oaths of office and abetted a violent insurrection on our democracy. Thus far, they have refused to step down from their posts.</p>\n<p><strong>We are calling for their expulsion from the Senate under Article I, Section 5, of the United States Constitution.</strong> This provision allows \"Each House [of Congress] may determine the Rules of its proceedings, punish its members for disorderly behavior, and, with the concurrence of two-thirds, expel a member.\"</p>\n<p>We don't take this call to action lightly: since 1789, the Senate has expelled only fifteen of its entire membership. <strong>Of those fifteen, all but one were expelled for supporting the Confederacy during the Civil War.&nbsp;</strong></p>\n<p>Sign the petition and call on our United States Senators to expel Senators Cruz and Hawley now.&nbsp;</p>", "image_url": "https://assets.change.org/photos/9/mx/sh/cFmXSHGjyyXEHYg-800x450-noPad.jpg?1610431660"}, {"title": "Petition From Stanford University Community Members Regarding Senator Josh Hawley", "description": "<p>The undersigned students, alumni, and educators of Stanford University, write to condemn the open sedition against the United States of America by Senator Josh Hawley of Missouri (Stanford University, AB, History, 2002).</p>\n<p>We fully endorse the January 1, 2021 <a href=\"https://www.google.com/url?q=https://www.google.com/url?q%3Dhttps://docs.google.com/forms/d/e/1FAIpQLSedMK3B8XRPCX2KW7z8akhbxLB9G99VKjyr34PNNTQYZ892Ag/viewform?gxids%253D7628%26amp;sa%3DD%26amp;ust%3D1610043037279000%26amp;usg%3DAOvVaw1SbofmRdxTHnzim5gQigGn&amp;sa=D&amp;ust=1610043037288000&amp;usg=AOvVaw2UhEl7_PLSTgyxaFGcqHhq\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">letter from Yale Law School Community</a>&nbsp;and the <a href=\"https://www.stanforddaily.com/2021/01/06/stanford-leadership-professors-condemn-storming-of-capitol-by-pro-trump-rioters/?fbclid=IwAR01zNBoQ7KbX7FgDl-oPEojADvfp-cHuX1GGL2APHISVLJ_oyA5LACUvcY\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">statements from Stanford leadership</a>&nbsp;condemning Senator Hawley’s recent actions. &nbsp;The events of January 6, 2021 compel us not only to join those statements, but to add our own voices in condemning in the strongest possible terms the actions of Senator Hawley.</p>\n<p>In their January 1 letter, the Yale Law School Community wrote that “while Senator Hawley’s effort [objecting to the results of the 2020 Presidental election] &nbsp;is obviously doomed to failure, it is still a bare-faced assault on our democracy and a contemptible gesture toward a coup d’etat by President Donald J. Trump and his supporters.”</p>\n<p>The armed insurrection against the Capitol on January 6 was not a mere gesture toward a coup d’etat, but an actual attempted coup. Senator Hawley bears direct responsibility for that coup, including the injuries and death that occurred. A well publicized <a href=\"https://i.dailymail.co.uk/1s/2021/01/06/23/37698512-0-image-a-42_1609977211936.jpg\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">photo of Senator Hawley</a>&nbsp;shows him giving a raised fist salute to the armed insurrectionists just before the rioting and invasion of the Capitol began.</p>\n<p>18 U.S.C. § 2384 defines seditious conspiracy as follows:</p>\n<ul>\n<li>If two or more persons in any State or Territory, or in any place subject to the jurisdiction of the United States, conspire to overthrow, put down, or to destroy by force the Government of the United States, or to levy war against them, or to oppose by force the authority thereof, or by force to prevent, hinder, or delay the execution of any law of the United States, or by force to seize, take, or possess any property of the United States contrary to the authority thereof, they shall each be fined or imprisoned not more than 20 years, or both.</li>\n</ul>\n<p>We call upon law enforcement authorities to investigate Sen. Hawley for engaging in seditious conspiracy, along with the other Senators and Representatives who actively encouraged the invasion of the Capitol on January 6, 2021.</p>\n<p>We further call upon Sen. Hawley to resign his Senate seat. His continued role in public life presents a clear and present danger to American democracy.</p>\n<p>Finally, we call upon Stanford University, to the maximum extent possible, to sever all ties with Sen. Hawley.</p>", "image_url": "https://assets.change.org/photos/7/lu/un/MZLuunwMYZHAMla-800x450-noPad.jpg?1610039691"}, {"title": "Petition for the Resignation of Sen. Tommy Tuberville (R) AL", "description": "<p>Senator Tuberville knowingly and willfully violated his oath of office as Senator failing to support, defend, and uphold the Constitution of the United States of America by supporting and voting in favor of contesting the votes of the 2020 Presidential Election. By doing so, it is our sentiment that he has disgraced the office of senator and the great state of Alabama and as such we, his constituents, request that he respectfully tender his resignation as U.S. Senator representing Alabama.</p>", "image_url": "https://assets.change.org/photos/5/xk/yx/rexKYXccTuZvJRh-800x450-noPad.jpg?1610131070"}, {"title": "Protect Essential Autism Care in PA Before January 17, 2021", "description": "<p>On January 17, thousands of Pennsylvania kids will lose the autism care they need because 1:1 center-based ABA services will not be reimbursed by Medicaid.</p>\n<p>A child’s access to 1:1 ABA services, when deemed medically necessary by a qualified treatment provider, must not be restricted by location. Families should have the freedom to make the decision to pursue center-based, 1:1 ABA services based upon the child’s needs.</p>\n<p>In addition, there should be no financial risk to providers who want to make these services available. A child’s family shouldn’t have to demonstrate that an exception or special consideration applies in order to get coverage for 1:1 clinic-based services.</p>\n<p>The decision to restrict center-based care is NOT just a problem for families during the COVID crisis, but will stop kids from getting needed care even after pandemic-related restrictions come to an end.</p>\n<p><strong>The signers of this petition urge Pennsylvania's Office of Mental Health and Substance Abuse Services to reverse the IBHS position and restore full access to center-based 1:1 ABA services.</strong></p>\n<p><em>The ABA Our Way advocacy campaign aims to ensure that Intensive Behavior Health Services (IBHS) in Pennsylvania support the provision of 1:1 ABA services in a center for children who need them. ABA Our Way is a collaboration of Pennsylvania-based organizations and individuals that serve children with autism. This campaign is supported by autism organizations from across the nation.</em></p>", "image_url": "https://assets.change.org/photos/8/ng/yn/PDNgynTWnZqBXrc-800x450-noPad.jpg?1609262078"}, {"title": "Improve the Equity and Quality of Supportive Housing for the Mentally Ill", "description": "<p>There are over 11 million adults in this country suffering from severe mental illness, like schizophrenia and other psychotic brain diseases.&nbsp; Approximately half of them do not have sufficient treatment programs, access to care, or a stable home. They can be found on the streets, in prisons, and in the homes of loved ones desperately trying to find a way to help them. I am one of those millions of parents.&nbsp; Supportive housing is supposed to provide stable homes, job training and treatment assistance, but it is few and far between. Far worse, there is no system of monitoring these facilities to ensure safe and efficient care for these individuals at-risk to be victimized or to commit crimes in their psychosis. With treatment, therapy and stability they can lead lives as participating members of our communities, but we need your help. We need to develop many more supported housing facilities across the country, and create a systems of standards and measures to assure the quality of these facilities and their services. Please show your support for this effort by signing this petition and contact us to participate.</p>", "image_url": "https://assets.change.org/photos/6/pq/gi/LPPqgiVYGJLeEwi-800x450-noPad.jpg?1609701025"}]}